[
  {
    "id": 1,
    "name": "The Legend of Zelda: Breath of the Wild",
    "releaseDate": "2017-03-03",
    "rating": 4.97,
    "tags": ["open-world", "adventure", "nintendo", "physics", "exploration"],
    "img": "https://upload.wikimedia.org/wikipedia/en/c/c6/The_Legend_of_Zelda_Breath_of_the_Wild.jpg",
    "shortDescription": "Open‑world adventure in Hyrule.",
    "fullDescription": "Breath of the Wild redefines open-world gaming with its sprawling version of Hyrule that encourages organic exploration. The game introduces physics-based systems where metal objects conduct electricity, wooden items burn, and cold environments require warm clothing. Players can climb nearly any surface with a stamina system that gradually improves. The 'chemistry engine' allows for creative solutions like using fire to create updrafts for paragliding. Divine Beasts replace traditional dungeons as massive, movable puzzles. Weapon durability adds strategic depth, while the cooking system lets players create meals with various buffs. Over 120 Shrines offer bite-sized challenges, and the Master Trials DLC adds brutal combat scenarios. The game's minimalist approach to storytelling through environmental cues and 'memories' creates a uniquely immersive experience."
  },
  {
    "id": 2,
    "name": "Red Dead Redemption 2",
    "releaseDate": "2018-10-26",
    "rating": 4.96,
    "tags": ["western", "open-world", "story-driven", "realistic", "rockstar"],
    "img": "https://upload.wikimedia.org/wikipedia/en/4/44/Red_Dead_Redemption_II.jpg",
    "shortDescription": "Wild West epic from Rockstar.",
    "fullDescription": "This cinematic masterpiece set in 1899 follows Arthur Morgan and the Van der Linde gang's struggle during the decline of the outlaw era. The game sets new standards for open-world realism with features like: horse testicles that shrink in cold weather, visible hair growth, and mud that accumulates on clothing. The honor system dynamically affects how NPCs interact with you. Camp members have unique daily routines and remember your actions. Hunting requires proper shot placement to preserve pelts, while fishing offers serene moments. The weapon maintenance system adds realism - guns jam if not cleaned. Story missions balance cinematic set-pieces with player agency, while optional robberies and bounty hunting provide emergent gameplay. The epilogue alone offers 6+ hours of content, transitioning seamlessly into the original Red Dead Redemption's timeline."
  },
  {
    "id": 3,
    "name": "God of War",
    "releaseDate": "2018-04-20",
    "rating": 4.95,
    "tags": ["mythology", "action", "father-son", "single-player", "norse"],
    "img": "https://upload.wikimedia.org/wikipedia/en/a/a7/God_of_War_4_cover.jpg",
    "shortDescription": "Father‑son journey in Norse realm.",
    "fullDescription": "This franchise reboot reimagines Kratos as a older, wiser father figure in the Norse realms. The game's continuous camera shot creates unparalleled immersion as you journey with Atreus to scatter his mother's ashes. Combat focuses on the Leviathan Axe - throw it at enemies or environmental puzzles, then recall it like Thor's hammer. Atreus evolves from liability to competent ally as you upgrade his skills. The Lake of Nine's water level changes reveal new areas over time. Valkyrie battles offer brutal optional challenges. The game seamlessly transitions between intimate character moments and epic boss fights against Norse gods. Puzzle-solving often involves deciphering runic lore, while the equipment crafting system encourages exploration. The post-game opens up new realms including the punishing Niflheim maze and fiery Muspelheim trials."
  },
  {
    "id": 4,
    "name": "The Witcher 3: Wild Hunt",
    "releaseDate": "2015-05-19",
    "rating": 4.98,
    "tags": ["rpg", "fantasy", "choices-matter", "monster-hunter", "open-world"],
    "img": "https://upload.wikimedia.org/wikipedia/en/0/0c/Witcher_3_cover_art.jpg",
    "shortDescription": "Massive fantasy RPG with Geralt.",
    "fullDescription": "As Geralt of Rivia, players explore a war-torn continent searching for Ciri while dealing with the supernatural Wild Hunt. The game revolutionized RPG storytelling with its 'lesser evil' philosophy - choices often have no perfect outcome. Contracts involve detective work using Witcher senses before monster battles requiring preparation with oils and potions. The dynamic economy affects prices based on local events. Gwent, the in-game card game, became so popular it spawned a standalone title. The Blood and Wine expansion adds an entire new region (Toussaint) with 30+ hours of content featuring vampire politics and a vineyard base. Graphics options like Nvidia HairWorks render individual strands of Geralt's hair. The game's mature storytelling tackles themes of racism, war trauma, and parenthood through layered side quests that often surpass main stories of other RPGs."
  },
  {
    "id": 5,
    "name": "Minecraft",
    "releaseDate": "2011-11-18",
    "rating": 4.99,
    "tags": ["sandbox", "building", "survival", "creative", "multiplayer"],
    "img": "https://upload.wikimedia.org/wikipedia/en/5/51/Minecraft_cover.png",
    "shortDescription": "Block‑building sandbox game.",
    "fullDescription": "This cultural phenomenon offers limitless creativity across multiple modes: Survival (manage hunger while building), Creative (unlimited resources), Adventure (custom maps), and Hardcore (permadeath). The Redstone system allows for functional electronics like calculators and automated farms. Biomes range from mushroom islands to deep dark caves with the terrifying Warden. Updates regularly add new content like archeology systems and cherry blossom groves. The Nether and End dimensions offer alternative progression paths with unique resources and bosses. Education Edition includes chemistry features and coding elements. Servers host everything from minigames to fully functional MMOs. Speedrunning communities race to defeat the Ender Dragon, while builders recreate everything from Middle-earth to working CPUs. The game's simple aesthetic belies incredible depth - from villager trading economies to complex potion brewing systems."
  },
  {
    "id": 6,
    "name": "Grand Theft Auto V",
    "releaseDate": "2013-09-17",
    "rating": 4.94,
    "tags": ["open-world", "crime", "satire", "multiplayer", "sandbox"],
    "img": "https://upload.wikimedia.org/wikipedia/en/a/a5/Grand_Theft_Auto_V.png",
    "shortDescription": "Crime saga in Los Santos.",
    "fullDescription": "Rockstar's magnum opus features three playable protagonists: retired bank robber Michael, ambitious gangster Franklin, and psychotic Trevor. The heist mechanics allow for different approaches (loud vs. stealth) with crew members affecting success rates. Los Santos offers unparalleled diversity - from urban sprawl to wilderness with working animals. Activities include stock trading affected by in-game actions, tennis, yoga, and movie-going. GTA Online continues receiving updates years later with businesses, races, and elaborate heists. The game's satire targets modern culture including social media (LifeInvader), conspiracy theorists (Epsilon Program), and reality TV. First-person mode added in next-gen versions creates immersive shootouts. Wildlife behaves realistically with predators hunting prey. The soundtrack spans 17 radio stations with over 240 licensed tracks. Hidden mysteries like the Mount Chiliad UFO continue fueling fan theories."
  },
  {
    "id": 7,
    "name": "Super Mario Odyssey",
    "releaseDate": "2017-10-27",
    "rating": 4.93,
    "tags": ["platformer", "nintendo", "collectathon", "family-friendly", "sandbox"],
    "img": "https://upload.wikimedia.org/wikipedia/en/8/8d/Super_Mario_Odyssey.jpg",
    "shortDescription": "3D Mario adventure across kingdoms.",
    "fullDescription": "Mario's globe-trotting adventure introduces Cappy - a sentient hat enabling 'capture' mechanics to possess enemies and objects. Each kingdom offers unique gameplay: become a T-Rex in Cascade Kingdom, control tanks in Metro Kingdom, or race as a scooter in Seaside Kingdom. The outfit system allows for creative combinations with some granting special abilities. Moons replace stars as collectibles, with over 800 available through puzzles, challenges, and hidden areas. The game seamlessly transitions between 3D and 2D pixel-art sections. New Donk City's urban environment contrasts with traditional Mario settings, featuring a full musical number. Assist mode helps younger players with extra health and arrow guidance. Post-game content unlocks darker versions of kingdoms with remixed challenges. The snapshot mode includes filters and poses for creative photography. Luigi's Balloon World adds endless hide-and-seek gameplay."
  },
  {
    "id": 8,
    "name": "Horizon Zero Dawn",
    "releaseDate": "2017-02-28",
    "rating": 4.45,
    "tags": ["open-world", "sci-fi", "robots", "post-apocalyptic", "action-rpg"],
    "img": "https://upload.wikimedia.org/wikipedia/en/0/0d/Horizon_Zero_Dawn.jpg",
    "shortDescription": "Post‑apocalyptic hunt with Aloy.",
    "fullDescription": "In a world where robotic creatures dominate nature-reclaimed ruins, Aloy uncovers her origins and the truth behind the 'Old Ones' downfall. Combat emphasizes strategic weak point targeting - removing components yields resources and alters enemy behavior. The skill tree branches into stealth, combat, and survival specializations. Tallnecks act as moving climbable towers revealing map data. Cauldrons unlock the ability to override machines as mounts or allies. The Frozen Wilds DLC introduces the Banuk tribe and tougher machines with new elemental attacks. Environmental storytelling reveals the tragic Faro Plague through holograms and audio logs. Weapon techniques like triple-shot arrows add combat variety. The day-night cycle affects machine patrol routes, while weather conditions impact visibility. Photo mode captures stunning landscapes juxtaposing primitive tribes with futuristic ruins."
  },
  {
    "id": 9,
    "name": "Persona 5 Royal",
    "releaseDate": "2019-03-31",
    "rating": 4.97,
    "tags": ["jrpg", "social-sim", "turn-based", "anime", "psychological"],
    "img": "https://upload.wikimedia.org/wikipedia/en/6/65/Persona_5_Royal_cover_art.jpg",
    "shortDescription": "Stylish JRPG about phantom thieves.",
    "fullDescription": "This enhanced edition adds a new semester, characters, and gameplay refinements. As Joker, you balance high school life (raising stats via activities) with leading the Phantom Thieves who change hearts by stealing distorted desires from Palaces. Confidant relationships unlock combat perks and story content - from a journalist exposing corruption to a grieving widow finding purpose. The turn-based combat emphasizes exploiting weaknesses for 'All-Out Attacks.' Mementos offers randomized dungeon crawling with evolving mechanics. The new grappling hook opens alternate paths in Palaces. Showtime attacks provide cinematic dual finishers. The Thieves Den serves as a museum for unlocked content, while the Jazz Club offers stat-boosting dates. The third semester explores themes of reality vs. illusion through an entirely new story arc culminating in one of gaming's most emotional final bosses."
  },
  {
    "id": 10,
    "name": "Celeste",
    "releaseDate": "2018-01-25",
    "rating": 4.50,
    "tags": ["platformer", "indie", "mental-health", "difficult", "pixel-art"],
    "img": "https://upload.wikimedia.org/wikipedia/en/9/9c/Celeste_cover_art.png",
    "shortDescription": "Challenging pixel‑art platformer.",
    "fullDescription": "Madeline's journey up Celeste Mountain becomes a metaphor for overcoming anxiety and self-doubt. The ultra-precise platforming requires mastering air dashes, wall climbs, and mid-air direction changes. Over 700 screens are divided into chapters with distinct mechanics - from dream blocks that phase in/out to wind currents altering jump arcs. Assist options allow adjusting game speed or granting infinite stamina without penalty. B-side tapes unlock remixed harder versions of levels with new music. The narrative explores mental health through Madeline's interactions with her reflection Badeline and supportive NPCs like Theo. Hidden crystal hearts require solving environmental puzzles referencing other games. Farewell, the free DLC chapter, adds wavedashing and introduces a heartbreaking story about letting go. The dynamic piano soundtrack by Lena Raine reacts to player actions, swelling during climactic moments."
  },
  {
    "id": 11,
    "name": "Dark Souls III",
    "releaseDate": "2016-03-24",
    "rating": 4.91,
    "tags": ["souls-like", "difficult", "action-rpg", "dark-fantasy", "boss-fights"],
    "img": "https://upload.wikimedia.org/wikipedia/en/2/27/Dark_Souls_III.jpg",
    "shortDescription": "Brutal action RPG in dark world.",
    "fullDescription": "The final installment in the Dark Souls trilogy refines the series' signature challenging combat and intricate world design. Players explore the decaying kingdom of Lothric, battling grotesque enemies and towering bosses with precise swordplay, dodges, and parries. The game introduces Weapon Arts - special abilities unique to each weapon class, adding new tactical depth. Multiplayer features include cooperative summons, PvP invasions, and covenant factions with unique rewards. The interconnected world loops back on itself with clever shortcuts, while lore is revealed through item descriptions and environmental storytelling. The DLC expansions (Ashes of Ariandel and The Ringed City) introduce new areas with some of the series' most memorable boss fights. The game's haunting soundtrack and oppressive atmosphere create a sense of melancholy beauty amidst the brutality."
  },
  {
    "id": 12,
    "name": "Overwatch",
    "releaseDate": "2016-05-24",
    "rating": 4.60,
    "tags": ["fps", "hero-shooter", "multiplayer", "team-based", "blizzard"],
    "img": "https://upload.wikimedia.org/wikipedia/en/5/51/Overwatch_banner.jpg",
    "shortDescription": "Team‑based hero shooter.",
    "fullDescription": "Blizzard's team-based shooter features a diverse cast of heroes with unique abilities across three roles: Damage, Tank, and Support. Objective-based game modes like Payload and Control require teamwork and strategic hero switching to counter opponents. The game's vibrant art style and character-driven lore (revealed through animated shorts and comics) created a passionate fan community. Seasonal events introduce limited-time modes and cosmetics, while the Workshop allows players to create custom games. Overwatch 2 will replace the original, carrying forward player progress while adding PvE story missions. The game's emphasis on teamwork over individual skill and its 'play of the game' highlights made it accessible while rewarding mastery. Each hero plays dramatically differently, from Tracer's blink-and-recall mobility to Reinhardt's frontline shield tanking."
  },
  {
    "id": 13,
    "name": "Fortnite",
    "releaseDate": "2017-07-21",
    "rating": 4.30,
    "tags": ["battle-royale", "multiplayer", "building", "cross-platform", "free-to-play"],
    "img": "https://upload.wikimedia.org/wikipedia/en/0/09/Fortnite_cover_art.jpg",
    "shortDescription": "Battle royale megahit.",
    "fullDescription": "Fortnite Battle Royale popularized the building-shooter hybrid genre, where 100 players compete to be the last standing while constructing defensive structures on the fly. The game's cartoony art style, frequent content updates, and free-to-play model made it a cultural phenomenon. Seasonal updates dramatically change the map and introduce new mechanics like vehicles or wildlife. The Item Shop offers cosmetic purchases, while the Battle Pass provides progression rewards. Creative mode lets players build their own islands and games. Live in-game concerts (like Travis Scott's Astronomical) blurred the line between games and virtual events. The game's building mechanics add a high skill ceiling - advanced techniques like 90-degree turns and box fighting separate casual and competitive players. Despite controversies over microtransactions, Fortnite remains a dominant force in gaming and pop culture."
  },
  {
    "id": 14,
    "name": "DOOM (2016)",
    "releaseDate": "2016-05-13",
    "rating": 4.65,
    "tags": ["fps", "fast-paced", "demons", "heavy-metal", "single-player"],
    "img": "https://upload.wikimedia.org/wikipedia/en/5/57/DOOM_cover_art.jpg",
    "shortDescription": "High‑octane demon‑slaying shooter.",
    "fullDescription": "This reboot of the classic FPS franchise modernizes the series' signature fast-paced combat while staying true to its roots. As the Doom Slayer, players rip through hordes of demons in hellish UAC facilities on Mars. The game encourages aggressive play with its 'Glory Kill' system - melee finishers on staggered enemies drop health. Weapons range from the iconic Super Shotgun to the devastating BFG 9000, all modifiable with upgrades. The multiplayer mode offers classic arena-style combat, while SnapMap allows for custom level creation. Mick Gordon's industrial metal soundtrack, featuring the infamous 'DOOM theme,' perfectly complements the chaotic action. The game's movement is fluid, with double jumps and ledge grabs enabling acrobatic combat. Enemy designs stay faithful to the originals while adding terrifying new variants like the cybernetic Hell Knights. Environmental storytelling reveals the UAC's disastrous experiments with Hell energy."
  },
  {
    "id": 15,
    "name": "Sekiro: Shadows Die Twice",
    "releaseDate": "2019-03-22",
    "rating": 4.90,
    "tags": ["souls-like", "difficult", "stealth", "feudal-japan", "parry"],
    "img": "https://upload.wikimedia.org/wikipedia/en/5/5a/Sekiro_cover_art.jpg",
    "shortDescription": "Samurai action‑adventure from FromSoftware.",
    "fullDescription": "FromSoftware's take on feudal Japan follows Wolf, a shinobi sworn to protect a young lord with the power of immortality. The combat focuses on precise sword clashes - deflecting attacks at the right moment breaks enemy posture for deathblows. The prosthetic arm can be outfitted with tools like a grappling hook, shield-piercing axe, or flame vent. Stealth plays a major role, allowing players to thin enemy numbers before engaging. Unlike Souls games, Sekiro features defined characters and more direct storytelling while retaining cryptic lore elements. The resurrection mechanic (dying twice before truly perishing) enables risky plays. Areas are interconnected but more segmented than Dark Souls' fully open world. Boss fights against supernatural foes like the Guardian Ape or Lady Butterfly demand mastery of the posture system. The game's verticality and mobility create a fresh take on FromSoftware's signature challenge."
  },
  {
    "id": 16,
    "name": "The Elder Scrolls V: Skyrim",
    "releaseDate": "2011-11-11",
    "rating": 4.85,
    "tags": ["open-world", "rpg", "fantasy", "mods", "dragons"],
    "img": "https://upload.wikimedia.org/wikipedia/en/5/55/Skyrim_cover.png",
    "shortDescription": "Epic open‑world fantasy RPG.",
    "fullDescription": "Skyrim's sprawling province offers unparalleled freedom - players can ignore the main quest entirely to become thieves, mages, or werewolves. The game's Radiant AI system creates dynamic world interactions, while the Radiant Story system tailors some quests to your actions. Dragons randomly attack locations, requiring the player to master the Dragon Shout magic system. Guild questlines (Dark Brotherhood, Thieves Guild, etc.) provide hours of content each. The game's modding community has created everything from graphical overhauls to entirely new lands, extending its lifespan for over a decade. Skills improve through use rather than traditional leveling, encouraging organic character development. The Special Edition added remastered visuals and console mod support. From the frozen peaks of the Throat of the World to the subterranean Blackreach, Skyrim's world remains one of gaming's most immersive settings."
  },
  {
    "id": 17,
    "name": "Red Dead Redemption",
    "releaseDate": "2010-05-18",
    "rating": 4.80,
    "tags": ["western", "open-world", "story-driven", "rockstar", "single-player"],
    "img": "https://upload.wikimedia.org/wikipedia/en/4/44/Red_Dead_Redemption.jpg",
    "shortDescription": "Original Wild West tale.",
    "fullDescription": "John Marston's journey to hunt down his former gang members across the American frontier and Mexico set the template for Rockstar's later open-world epics. The game captures the fading age of outlaws with its detailed environments - from dusty frontier towns to lush Mexican villages. Activities include cattle herding, poker, bounty hunting, and dueling. The Dead Eye targeting system slows time for precise shots, while the honor system affects how NPCs react. The Undead Nightmare DLC offers a standalone zombie story with supernatural gameplay twists. The game's narrative explores themes of redemption and the costs of civilization taming the frontier. Memorable characters like Landon Ricketts and Seth Briars populate the world with colorful personalities. The transition from the arid New Austin territories to the tropical landscapes of Nuevo Paraíso remains one of gaming's most striking environmental shifts."
  },
  {
    "id": 18,
    "name": "Mass Effect 2",
    "releaseDate": "2010-01-26",
    "rating": 4.92,
    "tags": ["sci-fi", "rpg", "choices-matter", "space-opera", "bioware"],
    "img": "https://upload.wikimedia.org/wikipedia/en/8/84/Mass_Effect_2_cover.png",
    "shortDescription": "Sci‑fi RPG with Commander Shepard.",
    "fullDescription": "Considered the pinnacle of the trilogy, Mass Effect 2 sees Shepard working with the shadowy Cerberus organization to assemble a team for a suicide mission against the mysterious Collectors. The game refined the original's combat into a tighter third-person shooter while retaining RPG elements. Loyalty missions for each squad member provide character depth and affect who survives the finale. The Paragon/Renegade system allows for diplomatic or ruthless solutions to conflicts. The Illusive Man remains one of gaming's most compelling antagonists, morally ambiguous and voiced perfectly by Martin Sheen. Planetary scanning for resources, while tedious, funds crucial ship upgrades that impact the ending. The game's climax, where every decision throughout the game determines crew survival, remains one of gaming's most intense sequences. The Shadow Broker DLC adds significant lore and sets up Mass Effect 3."
  },
  {
    "id": 19,
    "name": "Metal Gear Solid V: The Phantom Pain",
    "releaseDate": "2015-09-01",
    "rating": 4.88,
    "tags": ["stealth", "open-world", "tactical", "kojima", "military"],
    "img": "https://upload.wikimedia.org/wikipedia/en/0/09/Metal_Gear_Solid_V_The_Phantom_Pain_cover.png",
    "shortDescription": "Open‑world stealth from Kojima.",
    "fullDescription": "Hideo Kojima's final Metal Gear game introduces open-world infiltration across Afghanistan and Africa. As Punished 'Venom' Snake, players build Mother Base by extracting soldiers, resources, and even wildlife via Fulton balloons. The game's emergent gameplay allows for endless approaches - go in guns blazing, use stealth camouflage, or distract guards with decoy posters of anime girls. Buddy characters like D-Dog (who grows from pup to full companion) and Quiet (the sniper who bonds with Snake) add tactical options. The online FOB system lets players invade others' bases for resources. Despite its incomplete story (evidenced by cut content and the infamous Chapter 2), the gameplay represents the pinnacle of tactical espionage action. The hospital prologue and 'Shining Lights' mission showcase Kojima's unmatched ability to blend gameplay and narrative. The game's themes of language, revenge, and the cycle of violence resonate through its fragmented storytelling."
  },
  {
    "id": 20,
    "name": "Super Smash Bros. Ultimate",
    "releaseDate": "2018-12-07",
    "rating": 4.89,
    "tags": ["fighting", "crossover", "multiplayer", "nintendo", "competitive"],
    "img": "https://upload.wikimedia.org/wikipedia/en/5/58/Super_Smash_Bros._Ultimate.jpg",
    "shortDescription": "All‑star fighting crossover on Switch.",
    "fullDescription": "The definitive Smash Bros. experience brings together every character from the series' history (including DLC additions like Sora and Sephiroth) for chaotic platform fighting. The game features over 100 stages, 800 music tracks, and countless spirits (collectible character enhancements). World of Light offers a sprawling single-player adventure mixing RPG elements with classic Smash gameplay. Competitive players can disable items and play on tournament-legal stages, while casuals enjoy wacky matches with all assists on. The game's attention to detail shines through in character animations and movesets that reference their home games. Modes like Squad Strike (team battles) and Smashdown (character elimination) add variety. The roster spans gaming history from Mario to Minecraft's Steve, making it a celebration of the medium. Regular balance patches and online tournaments keep the community engaged years after release."
  },
  {
    "id": 21,
    "name": "Animal Crossing: New Horizons",
    "releaseDate": "2020-03-20",
    "rating": 4.82,
    "tags": ["life-sim", "relaxing", "multiplayer", "customization", "nintendo"],
    "img": "https://upload.wikimedia.org/wikipedia/en/d/d4/Animal_Crossing_New_Horizons.jpg",
    "shortDescription": "Relaxing island‑life simulator.",
    "fullDescription": "This timely release became a global comfort during lockdowns, allowing players to create their own island paradise. The game follows real-time seasons and hours, with events like cherry blossom season or winter snowfall. Players can terraform cliffs and rivers, place furniture outdoors, and design custom patterns for clothing and paths. Villagers have distinct personalities and may gift photos at maximum friendship. The Nook Miles system provides goals and rewards, while the stalk market (turnip trading) offers risky economic gameplay. Regular free updates added swimming, dream islands, and farming. The Happy Home Paradise DLC introduced professional interior design work. Multiplayer lets visitors shop, trade, or just admire islands. The game's calming soundtrack and lack of pressure made it a therapeutic escape for millions during stressful times."
  },
  {
    "id": 22,
    "name": "Cyberpunk 2077",
    "releaseDate": "2020-12-10",
    "rating": 3.90,
    "tags": ["open-world", "rpg", "cyberpunk", "futuristic", "choices-matter"],
    "img": "https://upload.wikimedia.org/wikipedia/en/9/9f/Cyberpunk_2077_box_art.jpg",
    "shortDescription": "Futuristic open‑world RPG in Night City.",
    "fullDescription": "Despite its rocky launch, Cyberpunk 2077 offers a richly detailed dystopia where players assume the role of V, a mercenary whose mind is slowly being overwritten by Johnny Silverhand's (Keanu Reeves) engram. The game's strengths lie in its main quest writing, side gigs (especially the Peralez conspiracy), and atmospheric world-building. Lifepaths (Nomad, Street Kid, Corpo) provide different prologues and dialogue options. Cyberware modifications grant abilities like mantis blades or hacking via the 'Breach Protocol' minigame. The Edgerunners update and Phantom Liberty DLC significantly improved stability and added gameplay depth. Night City's verticality and neon-lit districts (from corpo Plaza to the lawless Badlands) create a stunning but often underutilized setting. The game shines in intimate character moments with figures like Judy, Panam, and River, even if its open-world systems feel shallow compared to RPG peers."
  },
  {
    "id": 23,
    "name": "Half-Life: Alyx",
    "releaseDate": "2020-03-23",
    "rating": 4.95,
    "tags": ["vr", "fps", "story-driven", "puzzle", "valve"],
    "img": "https://upload.wikimedia.org/wikipedia/en/e/e7/HalfLife_Alyx_cover.jpg",
    "shortDescription": "VR return to Half‑Life universe.",
    "fullDescription": "Valve's VR masterpiece sets new standards for immersive storytelling and interaction. As Alyx Vance, players navigate City 17's quarantine zone to rescue her father Eli from the Combine. The game's physics-based gameplay makes every action tactile - reloading requires manually inserting magazines, while health stations need a firm hand press. Environmental puzzles utilize gravity gloves to grab distant objects, and combat demands careful ammo management. The Russell interactions showcase Valve's humor, while Jeff (the blind zombie) delivers one of gaming's most intense horror sequences. The game's finale not only advances the Half-Life lore dramatically but also demonstrates VR's potential for narrative moments impossible in flat gaming. Mod support allows for custom campaigns, extending the experience. Though demanding on hardware, Alyx remains the pinnacle of what VR gaming can achieve in storytelling and immersion."
  },
  {
    "id": 24,
    "name": "Resident Evil 2 (2019)",
    "releaseDate": "2019-01-25",
    "rating": 4.91,
    "tags": ["horror", "survival", "zombies", "remake", "single-player"],
    "img": "https://upload.wikimedia.org/wikipedia/en/9/9f/Resident_Evil_2_Remake.jpg",
    "shortDescription": "Modern remake of survival horror classic.",
    "fullDescription": "This reimagining of the 1998 classic modernizes the Raccoon City outbreak with over-the-shoulder camera (à la RE4) and stunning photorealistic visuals. Players choose between rookie cop Leon Kennedy or college student Claire Redfield, each with distinct campaigns and supporting characters. The RPD station's labyrinthine halls create tense encounters with zombies that require careful ammo conservation. Mr. X's unscripted stalking (especially in the 2nd Run mode) adds relentless pressure. Puzzles retain the series' signature obtuse charm, like the medallion statues or portable safe combinations. The game strikes a perfect balance between action and horror, with the lab section providing a thrilling climax. The 'Hardcore' mode brings back ink ribbons for manual saves, while the Ghost Survivors DLC offers 'what if' scenarios. The remake honors the original while standing as one of the finest survival horror games ever made."
  },
  {
    "id": 25,
    "name": "Stardew Valley",
    "releaseDate": "2016-02-26",
    "rating": 4.89,
    "tags": ["farming", "simulation", "indie", "relaxing", "rpg"],
    "img": "https://upload.wikimedia.org/wikipedia/en/0/0c/Stardew_Valley_cover.jpg",
    "shortDescription": "Charming farming RPG.",
    "fullDescription": "This one-man passion project by Eric Barone (ConcernedApe) expands on Harvest Moon's formula with deeper mechanics and heartfelt storytelling. Players inherit a neglected farm and restore it through crops, animals, and artisan goods. The town of Pelican Town hosts memorable characters with complex schedules and relationships - from the reclusive Sebastian to the energetic Abigail. Mining introduces combat against monsters, while fishing provides a challenging minigame. Community Center bundles or JojaMart membership offer different progression paths. Multiplayer lets friends work the same farm cooperatively. Regular free updates have added massive content like the Ginger Island resort, beach farm layout, and auto-petters. The game's pixel art and soundtrack create a cozy atmosphere perfect for unwinding. Whether min-maxing ancient fruit wine production or casually romancing villagers, Stardew Valley accommodates all playstyles while maintaining its wholesome charm."
  },
  {
    "id": 26,
    "name": "Among Us",
    "releaseDate": "2018-06-15",
    "rating": 4.20,
    "tags": ["multiplayer", "social-deduction", "party", "co-op", "indie"],
    "img": "https://upload.wikimedia.org/wikipedia/en/9/9a/Among_Us_cover_art.jpg",
    "shortDescription": "Social deduction multiplayer game.",
    "fullDescription": "This sleeper hit gained massive popularity during the pandemic as the perfect digital party game. 4-10 players crew a spaceship, completing tasks while impostors sabotage and kill. Emergency meetings allow heated debates using text or voice chat to deduce the impostors. The game thrives on player interactions - clever alibis, fake task animations, and psychological manipulation. Maps like The Skeld, Mira HQ, and Polus offer varied layouts and tasks. Customization options (hats, pets, colors) let players express individuality. The Airship update added new roles like the Scientist and Guardian Angel, while hide-and-seek mode offers casual play. Despite its simple visuals, Among Us creates unmatched moments of betrayal and triumph that vary wildly based on who's playing. Its accessibility (working on phones and low-end PCs) and streamer popularity cemented its cultural impact."
  },
  {
    "id": 27,
    "name": "Valheim",
    "releaseDate": "2021-02-02",
    "rating": 4.70,
    "tags": ["survival", "viking", "procedural", "co-op", "early-access"],
    "img": "https://upload.wikimedia.org/wikipedia/en/6/60/Valheim_cover.jpg",
    "shortDescription": "Viking survival in procedurally‑generated world.",
    "fullDescription": "This Early Access smash hit blends Norse mythology with punishing survival mechanics. Players start naked on the shores of a procedurally generated world, gathering resources to build shelters and craft gear. The game's biome progression (Meadows → Black Forest → Swamp, etc.) gates advancement through boss defeats that grant new abilities. Building utilizes a structural integrity system where unsupported constructions collapse. Sailing across stormy seas to discover new lands captures Viking exploration perfectly. Food provides timed buffs rather than constant hunger pressure, allowing for strategic preparation before battles. The game's 'low-poly meets lighting' art style creates stunning vistas, especially during thunderstorms. Despite being in development, Valheim's core loop of preparation, exploration, and boss fights already offers dozens of hours of content, especially when played cooperatively in dedicated servers."
  },
  {
    "id": 28,
    "name": "Death Stranding",
    "releaseDate": "2019-11-08",
    "rating": 4.30,
    "tags": ["walking-sim", "post-apocalyptic", "kojima", "social", "single-player"],
    "img": "https://upload.wikimedia.org/wikipedia/en/0/0c/Death_Stranding.jpg",
    "shortDescription": "Strand‑based open‑world by Kojima.",
    "fullDescription": "Hideo Kojima's divisive post-MGS project redefines open-world interaction as Sam Bridges (Norman Reedus), a courier reconnecting isolated cities in a supernatural America. Gameplay focuses on traversal physics - balancing cargo weight, navigating terrain with climbing anchors and ladders, and managing stamina. The asynchronous multiplayer lets players share structures like bridges or warning signs, creating a sense of collective rebuilding. BT encounters force stealth through haunted wastelands, while MULE camps add human threats obsessed with stealing cargo. The story explores themes of connection through its bizarre sci-fi concepts like the Beach (afterlife limbo) and repatriation (immortality). Celebrity cameos (from Conan O'Brien to Guillermo del Toro) add surreal charm. The Director's Cut expanded content with racing tracks and combat challenges. More meditative than action-packed, Death Stranding is a unique experiment in collaborative loneliness."
  },
  {
    "id": 29,
    "name": "Ghost of Tsushima",
    "releaseDate": "2020-07-17",
    "rating": 4.85,
    "tags": ["open-world", "samurai", "feudal-japan", "action", "story-driven"],
    "img": "https://upload.wikimedia.org/wikipedia/en/a/a8/Ghost_of_Tsushima.jpg",
    "shortDescription": "Feudal Japan action‑adventure.",
    "fullDescription": "This love letter to samurai cinema follows Jin Sakai's transformation from honorable warrior to stealthy 'Ghost' during the Mongol invasion of Tsushima. The island's breathtaking landscapes (modeled after real-world locations) change dynamically with weather and seasons. Combat balances katana duels with stance switching against different enemy types and Ghost tools like smoke bombs or kunai. The Guiding Wind system replaces minimaps with natural navigation cues. Side tales explore Tsushima's people and folklore, while bamboo strikes and haiku compositions offer peaceful respites. The Legends multiplayer mode adds supernatural co-op missions inspired by Japanese mythology. The Director's Cut introduced Iki Island expansion, exploring Jin's childhood trauma. From golden forests to crimson leaves, the game's painterly aesthetic makes every screenshot look like a classical ink wash painting come to life."
  },
  {
    "id": 30,
    "name": "Fall Guys: Ultimate Knockout",
    "releaseDate": "2020-08-04",
    "rating": 4.10,
    "tags": ["battle-royale", "party", "multiplayer", "family-friendly", "physics"],
    "img": "https://upload.wikimedia.org/wikipedia/en/3/3d/Fall_Guys_cover.jpeg",
    "shortDescription": "Chaotic, colorful battle royale.",
    "fullDescription": "This whimsical take on battle royale pits 60 jellybean-like contestants through obstacle courses and minigames until one victor remains. Rounds alternate between races (like Door Dash or Slime Climb), team games (Hoopsie Daisy, Egg Scramble), and finales (Hex-A-Gone, Royal Fumble). The physics-based movement creates hilarious unintended collisions and recoveries. Customization options include costumes from deep-cut gaming references (like Half-Life's Headcrab). The free-to-play transition expanded content with new rounds, creative tools, and cross-platform play. Special events introduce limited-time modes like squads or survival challenges. Despite its simplicity, mastering movement tech like dive jumps or grabbing strategies adds surprising depth. The game's cheerful presentation and short matches make it perfect for quick sessions, while the escalating chaos of later rounds keeps parties laughing."
  },
  {
    "id": 31,
    "name": "Marvel’s Spider-Man",
    "releaseDate": "2018-09-07",
    "rating": 4.87,
    "tags": ["superhero", "open-world", "action", "web-swinging", "insomniac"],
    "img": "https://upload.wikimedia.org/wikipedia/en/0/0c/Spider-Man_PS4_cover.jpg",
    "shortDescription": "Insomniac’s web‑swinging superhero adventure.",
    "fullDescription": "Insomniac's take on Peter Parker balances superheroics with personal drama during a breakout at the Raft prison. The web-swinging physics create an unparalleled sense of momentum and freedom across Manhattan. Combat blends Arkham-style counters with acrobatic web shots and gadget combinations (like impact webbing or drone strikes). The story explores mature themes through Peter's relationships with MJ, Aunt May, and a mentor-turned-villain Otto Octavius. Side activities include stopping street crimes, photographing landmarks, and clearing out enemy bases. The game's attention to detail shines in small touches - changing suits (with unique abilities) mid-swing, subway fast-travel animations, and J. Jonah Jameson's hilarious podcast rants. The City That Never Sleeps DLC adds new story chapters, while the remastered version includes visual upgrades and the Miles Morales prologue. Swinging at sunset while the orchestral score swells remains one of gaming's most joyful experiences."
  },
  {
    "id": 32,
    "name": "The Last of Us Part II",
    "releaseDate": "2020-06-19",
    "rating": 4.60,
    "tags": ["story-driven", "post-apocalyptic", "stealth", "emotional", "naughty-dog"],
    "img": "https://upload.wikimedia.org/wikipedia/en/4/4b/The_Last_of_Us_Part_II_cover.jpg",
    "shortDescription": "Emotional post‑apocalyptic tale.",
    "fullDescription": "This controversial sequel follows Ellie's quest for revenge in a brutal, morally complex story that divides perspectives between hunter and hunted. Gameplay expands the original's stealth-action with new mechanics like tall grass traversal, prone movement, and enemy dogs that track scent. The infected feature terrifying new variants like the Stalkers that hide in darkness. Seattle's overgrown urban environments range from flooded downtowns to overrun hospital basements. The game's technical achievements include unparalleled facial animation and seamless transitions between gameplay and cutscenes. Accessibility options set new industry standards, allowing players to tailor combat to their abilities. Flashback sequences provide emotional respite from the main narrative's intensity, particularly the museum segment. Despite polarizing narrative choices, the game's craftsmanship in level design, sound engineering (like the guitar playing system), and performance capture remains unquestionable."
  },
  {
    "id": 33,
    "name": "Uncharted 4: A Thief’s End",
    "releaseDate": "2016-05-10",
    "rating": 4.83,
    "tags": ["adventure", "action", "cinematic", "treasure-hunt", "naughty-dog"],
    "img": "https://upload.wikimedia.org/wikipedia/en/8/8e/Uncharted_4_Box_Art.jpg",
    "shortDescription": "Nolan Drake’s final treasure hunt.",
    "fullDescription": "Nathan Drake's supposed last adventure takes him from auction house heists to pirate utopias in Madagascar. The game refines Uncharted's formula with larger environments offering multiple approach paths and optional dialogue. The jeep sequences provide open-ended traversal puzzles, while the grappling hook adds verticality to combat. Set pieces like the clock tower collapse and auction infiltration showcase Naughty Dog's mastery of interactive cinema. The story explores themes of obsession through Nate's relationship with his long-lost brother Sam and the libertarian pirate Henry Avery. Multiplayer blends gunplay with supernatural relics, while the robust photo mode captures the stunning vistas. The Lost Legacy standalone DLC shifts focus to Chloe and Nadine's Indian adventure, proving the franchise's potential beyond Nate. From Scottish manor puzzles to tropical shoreline brawls, Uncharted 4 delivers a globe-trotting finale worthy of its charismatic hero."
  },
  {
    "id": 34,
    "name": "Bloodborne",
    "releaseDate": "2015-03-24",
    "rating": 4.89,
    "tags": ["souls-like", "gothic", "lovecraftian", "difficult", "ps4-exclusive"],
    "img": "https://upload.wikimedia.org/wikipedia/en/a/a5/Bloodborne.jpg",
    "shortDescription": "Lovecraftian gothic action RPG.",
    "fullDescription": "FromSoftware's PS4 exclusive trades Dark Souls' methodical combat for aggressive, rally-based mechanics where players regain health by striking back quickly. The cursed city of Yharnam hosts grotesque werewolf-like beasts that gradually give way to cosmic horror monstrosities. Trick weapons like the Saw Cleaver (extending into a long spear) offer versatile movesets, while firearms enable visceral parries. The Chalice Dungeons provide randomized, increasingly difficult labyrinths with unique bosses. The Old Hunters DLC introduces some of the series' most challenging encounters (Orphan of Kos) and iconic weapons (Rakuyo). Environmental storytelling reveals a society destroyed by its pursuit of eldritch knowledge through the Healing Church and School of Mensis. The game's oppressive atmosphere, punctuated by the haunting Doll in the Hunter's Dream, creates an unparalleled sense of dread and discovery. Those who persevere through the nightmare uncover one of gaming's most richly imagined horror worlds."
  },
  {
    "id": 35,
    "name": "Final Fantasy VII Remake",
    "releaseDate": "2020-04-10",
    "rating": 4.78,
    "tags": ["jrpg", "remake", "action-rpg", "fantasy", "square-enix"],
    "img": "https://upload.wikimedia.org/wikipedia/en/e/ec/Final_Fantasy_VII_Remake.jpg",
    "shortDescription": "Re‑imagined classic JRPG.",
    "fullDescription": "This reimagining of FFVII's Midgar section expands the original's 5-hour segment into a 40+ hour narrative with fully realized characters and locations. The hybrid combat blends real-time action with tactical ATB commands for spells and abilities. Weapon upgrades provide customization, while materia retains the classic magic and summon system. New characters like Roche and expanded roles for Avalanche members Jessie, Biggs, and Wedge add depth. The game's most controversial element is its meta-narrative about defying fate, hinted at through the mysterious Whispers. Side quests flesh out the slums' inhabitants, from the orphanage kids to the struggling merchants. Summons like Leviathan and Bahamut appear as spectacular cinematic attacks. The Honeybee Inn sequence became an internet sensation for its over-the-top choreography. While diverging from the original's plot, the Remake captures its spirit through stunning visuals, Nobuo Uematsu's rearranged score, and the beloved core cast's interactions."
  },
  {
    "id": 36,
    "name": "Monster Hunter: World",
    "releaseDate": "2018-01-26",
    "rating": 4.70,
    "tags": ["action-rpg", "co-op", "hunting", "boss-fights", "crafting"],
    "img": "https://upload.wikimedia.org/wikipedia/en/6/60/Monster_Hunter_World_cover_art.jpg",
    "shortDescription": "Co‑op monster‑hunting action RPG.",
    "fullDescription": "This series reboot welcomes newcomers to the New World while retaining the depth veterans expect. 14 weapon types (from nimble Dual Blades to massive Charge Axes) offer radically different playstyles. Hunts require studying monster behaviors and exploiting elemental weaknesses. The seamless maps (Ancient Forest, Coral Highlands, etc.) host intricate ecosystems where creatures interact dynamically. The Slinger tool enables environmental tricks like dropping boulders or flash pods to blind foes. Multiplayer scales difficulty but rewards teamwork with coordinated staggers and mounts. The endgame Grinding Lands and Iceborne expansion add challenging variants like the icy Velkhana. Palico companions provide support, while the Gathering Hub fosters community. From tracking footprints to carving tails, World makes every hunt feel like a grand expedition. The game's success lies in its satisfying feedback loop: hunt → craft better gear → hunt stronger monsters."
  },
  {
    "id": 37,
    "name": "The Sims 4",
    "releaseDate": "2014-09-02",
    "rating": 4.20,
    "tags": ["life-sim", "sandbox", "customization", "humor", "ea"],
    "img": "https://upload.wikimedia.org/wikipedia/en/a/a5/The_Sims_4_cover_art.png",
    "shortDescription": "Life simulation sandbox.",
    "fullDescription": "EA's life simulator starts with Create-a-Sim's intuitive drag-and-drop facial customization and Build Mode's room-based construction. Sims now multitask (eat while watching TV) and exhibit more nuanced emotions affected by traits and memories. Expansion packs add vampires, university life, and cottage living, while Stuff Packs focus on specific themes like laundry or tiny homes. The Gallery lets players share elaborate creations from celebrity replicas to fantasy castles. Despite initial criticism for missing features (like toddlers, later patched in), the game has evolved through updates adding pools, basements, and skin tones. Mods like WickedWhims or Slice of Life dramatically expand gameplay possibilities. Occults (aliens, spellcasters) provide supernatural alternatives to domestic routines. Whether recreating your dream home or orchestrating soap opera dramas, The Sims 4 remains the ultimate digital dollhouse with near-infinite possibilities."
  },
  {
    "id": 38,
    "name": "Splatoon 2",
    "releaseDate": "2017-07-21",
    "rating": 4.45,
    "tags": ["shooter", "multiplayer", "nintendo", "ink", "competitive"],
    "img": "https://upload.wikimedia.org/wikipedia/en/2/2e/Splatoon_2.jpg",
    "shortDescription": "Ink‑splattering team shooter.",
    "fullDescription": "Nintendo's colorful take on shooters emphasizes territory control over kills. Turf War matches reward covering the most ground with your team's ink, which also serves as movement fluid (swimming refills ammo). Weapons range from rapid-fire Shooters to roller brushes and charger snipers, each with unique sub-weapons (bombs, sprinklers) and specials (ink tornadoes, splashdowns). The single-player campaign explores ink mechanics through creative platforming challenges, while Salmon Run offers PvE horde mode. Regular Splatfests (theme-based competitions) divide the community into teams like Vampires vs. Werewolves. The Octo Expansion DLC adds a challenging rogue-like story mode with 80 missions. The game's aesthetic blends punk fashion with marine biology, featuring squid-kid Inklings and Octolings. Deep weapon customization (through ability chunks) and ranked modes (Tower Control, Rainmaker) provide long-term goals. Its family-friendly approach masks surprisingly strategic depth in movement and ink management."
  },
  {
    "id": 39,
    "name": "Super Mario Maker 2",
    "releaseDate": "2019-06-28",
    "rating": 4.50,
    "tags": ["platformer", "level-editor", "nintendo", "creative", "multiplayer"],
    "img": "https://upload.wikimedia.org/wikipedia/en/7/78/Super_Mario_Maker_2.jpg",
    "shortDescription": "User‑created Mario levels galore.",
    "fullDescription": "This sequel expands the Mario creation toolkit with new assets from Super Mario 3D World (like clear pipes and cat suits) and a full story mode with 100+ Nintendo-made levels. The Course Builder offers tools for traditional platforming, auto-scrolling music levels, or devious puzzle boxes. Multiplayer lets 4 players cooperatively build or compete in online levels. The game's charm lies in seeing the community's creativity - from exact recreations of other games to kaizo torture challenges. Tags and search filters help find desired level types (speedrun, puzzle, etc.). Endless Challenge mode provides infinite randomly selected levels with limited lives. Updates added features like world maps linking levels and Ninji Speedruns (competing against ghost data). Whether making legitimate tributes to Mario's history or absurd meme levels, Maker 2 celebrates the series' versatility while enabling players to become game designers themselves."
  },
  {
    "id": 40,
    "name": "Tetris Effect",
    "releaseDate": "2018-11-09",
    "rating": 4.65,
    "tags": ["puzzle", "rhythm", "vr", "trippy", "music"],
    "img": "https://upload.wikimedia.org/wikipedia/en/1/1b/Tetris_Effect_cover.jpg",
    "shortDescription": "Mesmerizing modern Tetris.",
    "fullDescription": "Tetsuya Mizuguchi's (Rez, Lumines) take on the classic puzzle game pairs falling blocks with synesthetic visuals and music that react to player actions. The Journey mode progresses through themed stages like underwater coral reefs or African savannas, each with unique soundscapes. Zone mechanic slows time temporarily for massive line clears. VR support (especially on PSVR) creates an immersive trance-like state where the world pulses with every rotation and drop. Weekly Connected events challenge players to collectively reach goals. The game's name refers to the psychological phenomenon where players see Tetris pieces in their mind's eye after prolonged play - an effect amplified here by the hypnotic presentation. From the gospel-inspired 'Connected' track to the euphoric climax of 'Metamorphosis,' Tetris Effect transforms the familiar formula into a meditative audiovisual experience that feels almost spiritual in its perfect harmony of sight, sound, and gameplay."
  },
  {
    "id": 41,
    "name": "Cuphead",
    "releaseDate": "2017-09-29",
    "rating": 4.55,
    "tags": ["run-and-gun", "hand-drawn", "difficult", "boss-rush", "1930s"],
    "img": "https://upload.wikimedia.org/wikipedia/en/4/4d/Cuphead_cover.png",
    "shortDescription": "1930s cartoon‑style run‑and‑gun.",
    "fullDescription": "This labor of love mimics 1930s Fleischer Studios animation with hand-drawn cel art and original jazz recordings. Gameplay focuses predominantly on elaborate boss fights (like the gambling frog King Dice or the demonic Dr. Kahl's robot), each with multiple transforming phases. Run-and-gun platforming levels provide variety between major encounters. The game's notorious difficulty demands pixel-perfect dodging and pattern memorization, though Simple mode offers a slightly easier introduction. Weapons like the spread shot or chaser allow for different strategies, while charms provide abilities like extra health or auto-parrying. The Delicious Last Course DLC adds Ms. Chalice as a playable character with new abilities and a sprawling island of additional bosses. Every frame's meticulous craftsmanship makes Cuphead a playable vintage cartoon, complete with film grain and authentic voice crackles. Its success proved the market for uncompromising, artistically distinct indie games."
  },
  {
    "id": 42,
    "name": "Rocket League",
    "releaseDate": "2015-07-07",
    "rating": 4.75,
    "tags": ["sports", "multiplayer", "physics", "competitive", "cars"],
    "img": "https://upload.wikimedia.org/wikipedia/en/d/d2/Rocket_League_Coverart.jpg",
    "shortDescription": "Soccer with rocket‑powered cars.",
    "fullDescription": "Psyonix's improbable blend of soccer and vehicular acrobatics became an esports phenomenon. Matches feature 1v1 to 4v4 teams boosting, flipping, and aerial-juggling a giant ball into goals. The physics-based gameplay is easy to grasp but difficult to master - advanced techniques include half-flips, wave dashes, and ceiling shots. Regular updates add new arenas (with alternate geometries like the Octagon) and cosmetic items (from DeLorean time machines to NFL decals). The competitive ranking system spans from Bronze to Supersonic Legend, while extra modes like Hoops (basketball) or Snow Day (hockey) provide variety. Trading and blueprint systems let players customize their cars with rare skins. Cross-platform play ensures healthy matchmaking pools. Rocket League's genius lies in its simplicity - no playbooks or complex rules, just cars, a ball, and endless possibilities for creative teamwork and individual skill expression."
  },
  {
    "id": 43,
    "name": "The Legend of Zelda: Ocarina of Time",
    "releaseDate": "1998-11-21",
    "rating": 4.95,
    "tags": ["adventure", "nintendo", "classic", "3d", "n64"],
    "img": "https://upload.wikimedia.org/wikipedia/en/6/6f/Ocarina_of_Time.jpg",
    "shortDescription": "Iconic N64 action‑adventure.",
    "fullDescription": "Often considered the greatest game of all time, Ocarina pioneered 3D adventure design with Z-targeting combat, context-sensitive buttons, and seamless horseback travel. Playing as both child and adult Link, players explore Hyrule's varied regions from the fiery Death Mountain to the watery Zora's Domain. The ocarina's melodies (like the haunting Song of Storms) manipulate time and weather, solving puzzles and opening secrets. Dungeons like the Forest Temple and Shadow Temple remain masterclasses in environmental storytelling and spatial design. The Master Quest (unlocked after beating the game) remixes dungeons for added challenge. Though its polygons show age, the art direction's fairy tale charm endures, from the bustling Castle Town to the serene Lon Lon Ranch. Navi's infamous 'Hey! Listen!' became a cultural touchstone, while the final battle against Ganondorf atop his crumbling castle remains one of gaming's most epic confrontations."
  },
  {
    "id": 44,
    "name": "Halo: Combat Evolved",
    "releaseDate": "2001-11-15",
    "rating": 4.85,
    "tags": ["fps", "sci-fi", "xbox", "master-chief", "classic"],
    "img": "https://upload.wikimedia.org/wikipedia/en/5/5e/HaloCE_cover.jpg",
    "shortDescription": "Legendary sci‑fi shooter.",
    "fullDescription": "Bungie's Xbox launch title revolutionized console shooters with its dual-stick controls, regenerating shields, and vehicular combat. As Master Chief, players crash-land on the mysterious ringworld Halo, uncovering its secrets while battling the Covenant aliens and the parasitic Flood. The game's sandbox design encourages creative approaches - grenade jumps, Warthog stunts, and exploiting enemy AI behaviors. The Library's repetitive corridors test patience, but moments like the silent cartographer beach assault or the warthog escape finale remain iconic. Multiplayer (originally system-link only) popularized LAN parties with classics like Blood Gulch. The remastered Anniversary edition updates graphics while allowing instant switching to the original visuals. Marty O'Donnell's choral soundtrack defined the series' epic tone. Halo's legacy lies in proving consoles could deliver PC-quality FPS experiences while introducing millions to competitive online play through Xbox Live's eventual launch."
  },
  {
    "id": 45,
    "name": "Portal 2",
    "releaseDate": "2011-04-19",
    "rating": 4.97,
    "tags": ["puzzle", "first-person", "dark-humor", "physics", "valve"],
    "img": "https://upload.wikimedia.org/wikipedia/en/f/f9/Portal2cover.jpg",
    "shortDescription": "Mind‑bending puzzle platformer.",
    "fullDescription": "Valve's sequel expands Portal's test chambers with new gels (bounce, speed, conversion), light bridges, and tractor beams while deepening the darkly comedic story. The single-player campaign reintroduces GLaDOS and adds Wheatley (Stephen Merchant), a delightfully inept AI core. Cooperative mode features Atlas and P-Body, two robots with their own hilarious dynamic. The Perpetual Testing Initiative allows players to create and share custom puzzles. J.K. Simmons' performance as Aperture Science founder Cave Johnson delivers legendary lines about lemons and mandatory morality cores. Environmental storytelling reveals Aperture's descent from 1950s optimism to GLaDOS' reign of terror. The game's writing balances laugh-out-loud humor with moments of unexpected poignancy, especially in the turret opera finale. Portal 2 stands as one of gaming's most perfectly paced experiences, constantly introducing and remixing mechanics without overstaying its welcome."
  },
  {
    "id": 46,
    "name": "Bioshock Infinite",
    "releaseDate": "2013-03-26",
    "rating": 4.65,
    "tags": ["fps", "story-driven", "steampunk", "alternate-history", "irrational"],
    "img": "https://upload.wikimedia.org/wikipedia/en/0/0e/BioShock_Infinite.jpg",
    "shortDescription": "Sky‑city shooter with deep themes.",
    "fullDescription": "Booker DeWitt's mission to rescue Elizabeth from the floating city of Columbia explores American exceptionalism, racism, and quantum paradoxes. The game's opening baptism sets the tone for a narrative filled with disturbing imagery and ideological extremism. Elizabeth's dimensional tears introduce dynamic combat variables like automated turrets or cover spots, while her AI companionship avoids typical escort mission frustrations. Skyhook rails enable thrilling aerial combat, though the two-weapon limit simplified the original's system. Vigors like Murder of Crows offer flashy powers, while gear provides passive buffs. The controversial ending's multiverse twists divided players but cemented Infinite's reputation for ambitious storytelling. Burial at Sea DLC bridges to the original Bioshock's Rapture. Despite gameplay concessions to mainstream appeal, Infinite's art direction (from Hall of Heroes propaganda to Finkton's oppressed workers) and Courtney Draper's performance as Elizabeth create an unforgettable experience."
  },
  {
    "id": 47,
    "name": "Hades",
    "releaseDate": "2020-09-17",
    "rating": 4.93,
    "tags": ["roguelike", "action", "greek-mythology", "indie", "supergiant"],
    "img": "https://upload.wikimedia.org/wikipedia/en/8/8f/Hades_cover_art.jpg",
    "shortDescription": "Mythological roguelike from Supergiant.",
    "fullDescription": "Supergiant's isometric roguelike casts players as Zagreus, Hades' rebellious son attempting to escape the Underworld. Each run through procedurally generated chambers offers new boons from Olympian gods (Zeus' lightning, Artemis' critical hits) that combine for synergistic builds. The game's genius lies in integrating failure into the narrative - characters acknowledge repeated deaths, while persistent upgrades make progression tangible. Gifting nectar to NPCs unlocks keepsakes and story revelations, deepening relationships with figures like Achilles or Nyx. The art style blends painterly environments with crisp character designs, while Darren Korb's soundtrack fuses rock and ancient instrumentation. Weapon variants (from shield bashes to railgun-esque Adamant Rail) encourage different playstyles. Heat system allows self-imposed challenges for better rewards. Hades redefines roguelikes by making every run, successful or not, feel like meaningful story progression in a richly imagined mythological world."
  },
  {
    "id": 48,
    "name": "Fire Emblem: Three Houses",
    "releaseDate": "2019-07-26",
    "rating": 4.70,
    "tags": ["strategy", "jrpg", "tactical", "anime", "nintendo"],
    "img": "https://upload.wikimedia.org/wikipedia/en/c/c0/Fire_Emblem_Three_Houses.jpg",
    "shortDescription": "Tactical RPG with school‑life sim.",
    "fullDescription": "This tactical RPG casts players as Byleth, a professor at Garreg Mach Monastery who must choose between leading the Black Eagles, Blue Lions, or Golden Deer houses. The calendar system divides time between monastery activities (teaching, cooking, fishing) and grid-based battles where permadeath (toggleable) raises stakes. Each house's story explores different perspectives on Fódlan's continent-spanning war, with the Black Eagles route splitting further based on player choices. Combat arts and battalions add strategic layers to the weapon triangle system. Support conversations reveal character backstories, from Dimitri's trauma to Edelgard's revolutionary ideals. The DLC Ashen Wolves adds a fourth house and underground abyss area. Reclassing students into wyvern lords or gremories allows for deep team customization. Three Houses masterfully blends life sim warmth with the series' signature tactical depth, creating one of the Switch's most content-rich RPGs."
  },
  {
    "id": 49,
    "name": "Call of Duty: Modern Warfare (2019)",
    "releaseDate": "2019-10-25",
    "rating": 4.30,
    "tags": ["fps", "multiplayer", "modern", "realistic", "warzone"],
    "img": "https://upload.wikimedia.org/wikipedia/en/4/42/Call_of_Duty_Modern_Warfare_cover_art.jpg",
    "shortDescription": "Rebooted modern‑war FPS.",
    "fullDescription": "This soft reboot of the Modern Warfare subseries introduces realistic gun handling and tactical movement to Call of Duty's arcade roots. The campaign follows CIA officer Alex and SAS sergeant Kyle Garrick in morally ambiguous missions like the controversial 'Highway of Death' sequence. Spec Ops mode offers cooperative missions tied to the narrative. Multiplayer emphasizes tactical play with doors, mounting, and night vision maps, while Gunfight provides intense 2v2 matches. The Gunsmith system allows unprecedented weapon customization with over 60 attachments per gun. Warzone, the free-to-play battle royale, integrates with Modern Warfare's progression, featuring the sprawling Verdansk map, Gulag respawn mechanic, and in-game currency system. Despite controversies over camping-friendly maps and strict skill-based matchmaking, the game's gunplay and audio design set new standards for military shooters. The integration with subsequent Black Ops titles created a persistent Call of Duty ecosystem."
  },
  {
    "id": 50,
    "name": "The Outer Worlds",
    "releaseDate": "2019-10-25",
    "rating": 4.25,
    "tags": ["rpg", "sci-fi", "choices-matter", "satire", "obsidian"],
    "img": "https://upload.wikimedia.org/wikipedia/en/0/0e/The_Outer_Worlds_cover_art.jpg",
    "shortDescription": "Satirical sci‑fi RPG.",
    "fullDescription": "Obsidian's spiritual successor to Fallout: New Vegas transports players to Halcyon, a corporate-controlled star system on the brink of collapse. The game's dark humor skewers unchecked capitalism through absurd brand loyalties and worker exploitation. Companions like the disillusioned priest Felix or the mad scientist Ellie provide unique quests and perspectives. The flaw system rewards roleplaying by granting perks for embracing character weaknesses like phobias. Tactical Time Dilation slows combat for precise targeting, while science weapons offer unconventional effects like shrink rays. Multiple endings reflect choices in dealing with factions like the anarchist Iconoclasts or the Board's authoritarian rule. Though smaller in scope than competitors, The Outer Worlds excels in reactive storytelling and player agency, with dialogue options reflecting skills like lying or intimidation. The Peril on Gorgon DLC adds a noir-inspired mystery, while Murder on Eridanos introduces a detective storyline."
  },
  {
    "id": 51,
    "name": "Disco Elysium",
    "releaseDate": "2019-10-15",
    "rating": 4.94,
    "tags": ["rpg", "detective", "choices-matter", "text-heavy", "indie"],
    "img": "https://upload.wikimedia.org/wikipedia/en/2/26/Disco_Elysium_cover.jpg",
    "shortDescription": "Narrative‑driven RPG detective game.",
    "fullDescription": "This isometric RPG dispenses with combat for pure dialogue and skill checks as an amnesiac detective solves a murder in the dystopian district of Martinaise. 24 skills (from Encyclopedia to Shivers) literally argue in your head, offering conflicting advice and insights. The political vision quests (communist, fascist, moralist, or ultra-liberal) react to your choices with disturbing self-awareness. Thought Cabinet allows internalizing beliefs that provide bonuses at psychological costs. The game's writing balances absurd humor (like convincing a mailbox of your detective skills) with profound meditations on addiction, failure, and revolution. The Final Cut added full voice acting, including the narrator's sardonic delivery. From the hauntingly beautiful soundtrack to the hand-painted environments, Disco Elysium creates an unparalleled roleplaying experience where every choice feels deeply personal. Its depiction of a broken world and broken protagonist seeking redemption resonates long after the mystery concludes."
  },
  {
    "id": 52,
    "name": "Returnal",
    "releaseDate": "2021-04-30",
    "rating": 4.40,
    "tags": ["roguelike", "third-person", "sci-fi", "difficult", "ps5-exclusive"],
    "img": "https://upload.wikimedia.org/wikipedia/en/d/d0/Returnal_cover.jpg",
    "shortDescription": "Roguelike third‑person shooter.",
    "fullDescription": "Housemarque's PS5 showcase follows Selene, an astronaut trapped in a time loop on the alien planet Atropos. The game blends bullet-hell shooter mechanics with roguelike structure - each death resets the world but leaves some permanent upgrades. The DualSense controller's adaptive triggers differentiate alt-fire modes, while haptic feedback conveys environmental details like rain. Biome variations range from crimson deserts to fractured citadels, each with distinct enemies and bosses. The haunting story explores psychological trauma through surreal imagery and cryptic logs. Online 'ghosts' of other players' deaths provide warnings or false hope. Tower of Sisyphus update added an endless challenge mode. Returnal's demanding gameplay and opaque narrative divided players, but its technical achievements (4K 60fps with ray tracing) and atmospheric dread make it a next-gen standout. The cycle of frustration and mastery captures the roguelike spirit while pushing the genre into AAA production values."
  },
  {
    "id": 53,
    "name": "Minecraft Dungeons",
    "releaseDate": "2020-05-26",
    "rating": 3.50,
    "tags": ["action-rpg", "dungeon-crawler", "loot", "co-op", "family-friendly"],
    "img": "https://upload.wikimedia.org/wikipedia/en/8/80/Minecraft_Dungeons_cover.jpg",
    "shortDescription": "Dungeon crawler in Minecraft universe.",
    "fullDescription": "This Diablo-inspired spinoff simplifies RPG mechanics for younger audiences while retaining loot-driven progression. Players choose from melee, ranged, or magic-focused builds, enhanced by artifacts like the Boots of Swiftness or Fireworks Arrow. The blocky aesthetic translates well to isometric dungeons filled with zombies, skeletons, and the new Illagers. Procedurally generated levels and daily trials provide replayability, though the lack of depth compared to genre leaders limits long-term appeal. The Creeping Winter and Jungle Awakens DLCs added new biomes and bosses. Cross-platform multiplayer allows cooperative play across devices. While lacking Minecraft's creativity or Diablo's complexity, Dungeons succeeds as an accessible introduction to action-RPG mechanics with charming visuals and stress-free combat perfect for family gaming sessions."
  },
  {
    "id": 54,
    "name": "Apex Legends",
    "releaseDate": "2019-02-04",
    "rating": 4.45,
    "tags": ["battle-royale", "fps", "hero-shooter", "multiplayer", "free-to-play"],
    "img": "https://upload.wikimedia.org/wikipedia/en/6/6e/Apex_legends_cover_art.jpg",
    "shortDescription": "Hero‑based battle royale.",
    "fullDescription": "Respawn's Titanfall universe battle royale popularized the ping communication system, allowing seamless teamwork without voice chat. Each 'Legend' has unique abilities - from Bloodhound's tracking scans to Pathfinder's grappling hook mobility. The game emphasizes movement with slide hops, wall jumps, and ziplines creating fluid engagements. The evolving map (World's Edge, Olympus, etc.) changes with seasonal lore events, like the destruction of Skull Town. Arenas mode offers 3v3 tactical matches outside the BR format. The crafting system lets players create gear mid-match, while EVO Shields reward aggressive play. Cross-progression and next-gen upgrades ensure longevity, though controversial monetization of cosmetics draws criticism. From the satisfying gunfeel to the character-driven storytelling in animated shorts, Apex sets the standard for hero shooters in the battle royale space, balancing accessibility with a high skill ceiling."
  },
  {
    "id": 55,
    "name": "League of Legends",
    "releaseDate": "2009-10-27",
    "rating": 4.80,
    "tags": ["moba", "competitive", "multiplayer", "esports", "free-to-play"],
    "img": "https://upload.wikimedia.org/wikipedia/en/7/77/League_of_Legends_logo.png",
    "shortDescription": "Popular MOBA from Riot Games.",
    "fullDescription": "Riot's flagship MOBA popularized esports with its competitive 5v5 matches on Summoner's Rift. Over 150 champions (from the mischievous Teemo to the celestial Aurelion Sol) offer diverse playstyles across roles like jungler or support. The game's meta evolves through seasonal updates introducing drakes, items, and map changes. Ranked play spans from Iron to Challenger, while ARAM and rotating game modes provide casual alternatives. The lore-rich Runeterra universe expanded through spin-offs (Legends of Runeterra, Ruined King) and the Arcane Netflix series. Toxic player behavior prompted systems like honor rewards and chat restrictions. Despite its steep learning curve, League's strategic depth (wave management, objective control) and constant evolution maintain its position as the world's most played PC game, with Worlds tournaments drawing millions of viewers."
  },
  {
    "id": 56,
    "name": "Dota 2",
    "releaseDate": "2013-07-09",
    "rating": 4.75,
    "tags": ["moba", "competitive", "steam", "complex", "esports"],
    "img": "https://upload.wikimedia.org/wikipedia/en/3/36/Dota_2_Logo.png",
    "shortDescription": "Valve’s flagship MOBA.",
    "fullDescription": "The spiritual successor to Warcraft III's Defense of the Ancients mod, Dota 2 is notorious for its punishing complexity. Heroes like Invoker (with 10 spells) or Meepo (controlling multiple clones) demand extraordinary micro-management. Matches revolve around last-hitting creeps, denying allies, and timing smoke ganks for map control. The International's crowdfunded prize pools (exceeding $40 million) highlight the game's esports dominance. Unlike League of Legends, Dota offers complete hero access from the start, with monetization focused on cosmetics like arcana sets. The game's balance patches dramatically shift the meta, while custom games like Auto Chess spawned their own genres. From Roshan pit fights to buyback decisions in late-game sieges, Dota 2 rewards game knowledge and teamwork like no other MOBA, creating intensely satisfying victories and humiliating defeats."
  },
  {
    "id": 57,
    "name": "Genshin Impact",
    "releaseDate": "2020-09-28",
    "rating": 4.35,
    "tags": ["gacha", "open-world", "anime", "action-rpg", "free-to-play"],
    "img": "https://upload.wikimedia.org/wikipedia/en/0/06/Genshin_Impact_cover.jpg",
    "shortDescription": "Open‑world action RPG gacha.",
    "fullDescription": "miHoYo's surprise hit combines Breath of the Wild's exploration with anime aesthetics and gacha monetization. Players control the Traveler searching for their lost sibling across the elemental nations of Teyvat. The game's real draw is its expanding roster of characters (like the fiery Diluc or the eccentric Hu Tao), obtained through the controversial wish system. Elemental reactions (Pyro + Hydro = Vaporize) create combat depth, while team compositions synergize abilities. Regular updates add new regions like Inazuma's Japanese-inspired islands or Sumeru's academic rainforests. The resin energy system gates progression, encouraging daily play. Despite accusations of predatory monetization, Genshin's production quality (full voice acting, orchestrated soundtracks) and generous free content keep players engaged. The Serenitea Pot offers housing customization, while events range from theater mechanics to tower defense minigames."
  },
  {
    "id": 58,
    "name": "Splatoon",
    "releaseDate": "2015-05-28",
    "rating": 4.40,
    "tags": ["shooter", "nintendo", "ink", "multiplayer", "wii-u"],
    "img": "https://upload.wikimedia.org/wikipedia/en/2/2c/Splatoon_cover_art.png",
    "shortDescription": "Original ink‑splatting shooter.",
    "fullDescription": "Nintendo's quirky take on shooters launched on Wii U with the novel concept of covering territory with colored ink. The single-player campaign introduces mechanics like swimming through ink for stealth or mobility, culminating in a boss fight against the hilarious DJ Octavio. Turf War remains the signature mode, prioritizing map control over kills. Weapons like rollers, chargers, and buckets offer distinct playstyles, while specials like the Killer Wail or Inkzooka provide game-changing moments. The Plaza's Miiverse integration let players share drawings and messages, creating a vibrant community hub. Splatfests (themed team competitions like Cats vs. Dogs) divided the player base in friendly rivalry. Though surpassed by its sequel, the original Splatoon proved Nintendo could innovate in the online shooter space while maintaining family-friendly charm. Its legacy lives on through iconic maps like Walleye Warehouse and the infectious Squid Sisters' pop songs."
  },
  {
    "id": 59,
    "name": "NBA 2K23",
    "releaseDate": "2022-09-09",
    "rating": 3.20,
    "tags": ["sports", "basketball", "simulation", "multiplayer", "microtransactions"],
    "img": "https://upload.wikimedia.org/wikipedia/en/e/e9/NBA_2K23_cover_art.jpg",
    "shortDescription": "Realistic basketball simulation.",
    "fullDescription": "2K's annual basketball franchise continues to dominate the sports genre with its realistic gameplay and expansive modes. MyCareer follows a customizable player's journey from college to the NBA, complete with cringeworthy storylines and neighborhood activities. MyTeam lets players build dream squads through card packs (and inevitable microtransactions). The Jordan Challenge recreates iconic moments from MJ's career with period-accurate visuals and commentary. On-court, the game refines stick controls for dribble moves, shot timing, and defensive positioning. The WNBA finally receives deeper franchise options beyond single seasons. Despite criticism over aggressive monetization and minimal year-to-year improvements, NBA 2K remains unmatched in presentation - from authentic arena atmospheres to Ernie Johnson's studio analysis. For basketball purists, the simulation sliders and robust coaching options deliver the most authentic NBA experience outside of attending a real game."
  },
  {
    "id": 60,
    "name": "FIFA 23",
    "releaseDate": "2022-09-30",
    "rating": 3.10,
    "tags": ["sports", "soccer", "simulation", "multiplayer", "ea"],
    "img": "https://upload.wikimedia.org/wikipedia/en/6/62/FIFA_23_cover.jpg",
    "shortDescription": "Latest EA Sports soccer sim.",
    "fullDescription": "The final FIFA-branded entry (before the EA Sports FC rebrand) introduces women's club teams and cross-play for the first time. Hypermotion2 technology captures more realistic animations, while the new risk/reward power shot mechanic adds scoring variety. Career mode lets players create player-managers and experience a 'buzz' system for transfer negotiations. Volta's street football returns with new locations and customization. Ultimate Team remains the controversial cash cow, with its card-collecting, chemistry systems, and relentless pack openings. The World Cup mode arrives via free update, featuring the 2022 Qatar tournament's official presentation. While criticized for iterative improvements and predatory monetization, FIFA's unparalleled licensing (over 700 teams and 30 leagues) ensures its dominance. The game's accessibility and pick-up-and-play appeal make it a staple for casual fans, even as its competitive scene struggles with mechanical inconsistencies."
  },
  {
    "id": 51,
    "name": "Disco Elysium",
    "releaseDate": "2019-10-15",
    "rating": 4.94,
    "tags": ["rpg", "detective", "choices-matter", "text-heavy", "indie"],
    "img": "https://upload.wikimedia.org/wikipedia/en/2/26/Disco_Elysium_cover.jpg",
    "shortDescription": "Narrative‑driven RPG detective game.",
    "fullDescription": "This isometric RPG dispenses with combat for pure dialogue and skill checks as an amnesiac detective solves a murder in the dystopian district of Martinaise. 24 skills (from Encyclopedia to Shivers) literally argue in your head, offering conflicting advice and insights. The political vision quests (communist, fascist, moralist, or ultra-liberal) react to your choices with disturbing self-awareness. Thought Cabinet allows internalizing beliefs that provide bonuses at psychological costs. The game's writing balances absurd humor (like convincing a mailbox of your detective skills) with profound meditations on addiction, failure, and revolution. The Final Cut added full voice acting, including the narrator's sardonic delivery. From the hauntingly beautiful soundtrack to the hand-painted environments, Disco Elysium creates an unparalleled roleplaying experience where every choice feels deeply personal. Its depiction of a broken world and broken protagonist seeking redemption resonates long after the mystery concludes."
  },
  {
    "id": 52,
    "name": "Returnal",
    "releaseDate": "2021-04-30",
    "rating": 4.40,
    "tags": ["roguelike", "third-person", "sci-fi", "difficult", "ps5-exclusive"],
    "img": "https://upload.wikimedia.org/wikipedia/en/d/d0/Returnal_cover.jpg",
    "shortDescription": "Roguelike third‑person shooter.",
    "fullDescription": "Housemarque's PS5 showcase follows Selene, an astronaut trapped in a time loop on the alien planet Atropos. The game blends bullet-hell shooter mechanics with roguelike structure - each death resets the world but leaves some permanent upgrades. The DualSense controller's adaptive triggers differentiate alt-fire modes, while haptic feedback conveys environmental details like rain. Biome variations range from crimson deserts to fractured citadels, each with distinct enemies and bosses. The haunting story explores psychological trauma through surreal imagery and cryptic logs. Online 'ghosts' of other players' deaths provide warnings or false hope. Tower of Sisyphus update added an endless challenge mode. Returnal's demanding gameplay and opaque narrative divided players, but its technical achievements (4K 60fps with ray tracing) and atmospheric dread make it a next-gen standout. The cycle of frustration and mastery captures the roguelike spirit while pushing the genre into AAA production values."
  },
  {
    "id": 53,
    "name": "Minecraft Dungeons",
    "releaseDate": "2020-05-26",
    "rating": 3.50,
    "tags": ["action-rpg", "dungeon-crawler", "loot", "co-op", "family-friendly"],
    "img": "https://upload.wikimedia.org/wikipedia/en/8/80/Minecraft_Dungeons_cover.jpg",
    "shortDescription": "Dungeon crawler in Minecraft universe.",
    "fullDescription": "This Diablo-inspired spinoff simplifies RPG mechanics for younger audiences while retaining loot-driven progression. Players choose from melee, ranged, or magic-focused builds, enhanced by artifacts like the Boots of Swiftness or Fireworks Arrow. The blocky aesthetic translates well to isometric dungeons filled with zombies, skeletons, and the new Illagers. Procedurally generated levels and daily trials provide replayability, though the lack of depth compared to genre leaders limits long-term appeal. The Creeping Winter and Jungle Awakens DLCs added new biomes and bosses. Cross-platform multiplayer allows cooperative play across devices. While lacking Minecraft's creativity or Diablo's complexity, Dungeons succeeds as an accessible introduction to action-RPG mechanics with charming visuals and stress-free combat perfect for family gaming sessions."
  },
  {
    "id": 54,
    "name": "Apex Legends",
    "releaseDate": "2019-02-04",
    "rating": 4.45,
    "tags": ["battle-royale", "fps", "hero-shooter", "multiplayer", "free-to-play"],
    "img": "https://upload.wikimedia.org/wikipedia/en/6/6e/Apex_legends_cover_art.jpg",
    "shortDescription": "Hero‑based battle royale.",
    "fullDescription": "Respawn's Titanfall universe battle royale popularized the ping communication system, allowing seamless teamwork without voice chat. Each 'Legend' has unique abilities - from Bloodhound's tracking scans to Pathfinder's grappling hook mobility. The game emphasizes movement with slide hops, wall jumps, and ziplines creating fluid engagements. The evolving map (World's Edge, Olympus, etc.) changes with seasonal lore events, like the destruction of Skull Town. Arenas mode offers 3v3 tactical matches outside the BR format. The crafting system lets players create gear mid-match, while EVO Shields reward aggressive play. Cross-progression and next-gen upgrades ensure longevity, though controversial monetization of cosmetics draws criticism. From the satisfying gunfeel to the character-driven storytelling in animated shorts, Apex sets the standard for hero shooters in the battle royale space, balancing accessibility with a high skill ceiling."
  },
  {
    "id": 55,
    "name": "League of Legends",
    "releaseDate": "2009-10-27",
    "rating": 4.80,
    "tags": ["moba", "competitive", "multiplayer", "esports", "free-to-play"],
    "img": "https://upload.wikimedia.org/wikipedia/en/7/77/League_of_Legends_logo.png",
    "shortDescription": "Popular MOBA from Riot Games.",
    "fullDescription": "Riot's flagship MOBA popularized esports with its competitive 5v5 matches on Summoner's Rift. Over 150 champions (from the mischievous Teemo to the celestial Aurelion Sol) offer diverse playstyles across roles like jungler or support. The game's meta evolves through seasonal updates introducing drakes, items, and map changes. Ranked play spans from Iron to Challenger, while ARAM and rotating game modes provide casual alternatives. The lore-rich Runeterra universe expanded through spin-offs (Legends of Runeterra, Ruined King) and the Arcane Netflix series. Toxic player behavior prompted systems like honor rewards and chat restrictions. Despite its steep learning curve, League's strategic depth (wave management, objective control) and constant evolution maintain its position as the world's most played PC game, with Worlds tournaments drawing millions of viewers."
  },
  {
    "id": 56,
    "name": "Dota 2",
    "releaseDate": "2013-07-09",
    "rating": 4.75,
    "tags": ["moba", "competitive", "steam", "complex", "esports"],
    "img": "https://upload.wikimedia.org/wikipedia/en/3/36/Dota_2_Logo.png",
    "shortDescription": "Valve’s flagship MOBA.",
    "fullDescription": "The spiritual successor to Warcraft III's Defense of the Ancients mod, Dota 2 is notorious for its punishing complexity. Heroes like Invoker (with 10 spells) or Meepo (controlling multiple clones) demand extraordinary micro-management. Matches revolve around last-hitting creeps, denying allies, and timing smoke ganks for map control. The International's crowdfunded prize pools (exceeding $40 million) highlight the game's esports dominance. Unlike League of Legends, Dota offers complete hero access from the start, with monetization focused on cosmetics like arcana sets. The game's balance patches dramatically shift the meta, while custom games like Auto Chess spawned their own genres. From Roshan pit fights to buyback decisions in late-game sieges, Dota 2 rewards game knowledge and teamwork like no other MOBA, creating intensely satisfying victories and humiliating defeats."
  },
  {
    "id": 57,
    "name": "Genshin Impact",
    "releaseDate": "2020-09-28",
    "rating": 4.35,
    "tags": ["gacha", "open-world", "anime", "action-rpg", "free-to-play"],
    "img": "https://upload.wikimedia.org/wikipedia/en/0/06/Genshin_Impact_cover.jpg",
    "shortDescription": "Open‑world action RPG gacha.",
    "fullDescription": "miHoYo's surprise hit combines Breath of the Wild's exploration with anime aesthetics and gacha monetization. Players control the Traveler searching for their lost sibling across the elemental nations of Teyvat. The game's real draw is its expanding roster of characters (like the fiery Diluc or the eccentric Hu Tao), obtained through the controversial wish system. Elemental reactions (Pyro + Hydro = Vaporize) create combat depth, while team compositions synergize abilities. Regular updates add new regions like Inazuma's Japanese-inspired islands or Sumeru's academic rainforests. The resin energy system gates progression, encouraging daily play. Despite accusations of predatory monetization, Genshin's production quality (full voice acting, orchestrated soundtracks) and generous free content keep players engaged. The Serenitea Pot offers housing customization, while events range from theater mechanics to tower defense minigames."
  },
  {
    "id": 58,
    "name": "Splatoon",
    "releaseDate": "2015-05-28",
    "rating": 4.40,
    "tags": ["shooter", "nintendo", "ink", "multiplayer", "wii-u"],
    "img": "https://upload.wikimedia.org/wikipedia/en/2/2c/Splatoon_cover_art.png",
    "shortDescription": "Original ink‑splatting shooter.",
    "fullDescription": "Nintendo's quirky take on shooters launched on Wii U with the novel concept of covering territory with colored ink. The single-player campaign introduces mechanics like swimming through ink for stealth or mobility, culminating in a boss fight against the hilarious DJ Octavio. Turf War remains the signature mode, prioritizing map control over kills. Weapons like rollers, chargers, and buckets offer distinct playstyles, while specials like the Killer Wail or Inkzooka provide game-changing moments. The Plaza's Miiverse integration let players share drawings and messages, creating a vibrant community hub. Splatfests (themed team competitions like Cats vs. Dogs) divided the player base in friendly rivalry. Though surpassed by its sequel, the original Splatoon proved Nintendo could innovate in the online shooter space while maintaining family-friendly charm. Its legacy lives on through iconic maps like Walleye Warehouse and the infectious Squid Sisters' pop songs."
  },
  {
    "id": 59,
    "name": "NBA 2K23",
    "releaseDate": "2022-09-09",
    "rating": 3.20,
    "tags": ["sports", "basketball", "simulation", "multiplayer", "microtransactions"],
    "img": "https://upload.wikimedia.org/wikipedia/en/e/e9/NBA_2K23_cover_art.jpg",
    "shortDescription": "Realistic basketball simulation.",
    "fullDescription": "2K's annual basketball franchise continues to dominate the sports genre with its realistic gameplay and expansive modes. MyCareer follows a customizable player's journey from college to the NBA, complete with cringeworthy storylines and neighborhood activities. MyTeam lets players build dream squads through card packs (and inevitable microtransactions). The Jordan Challenge recreates iconic moments from MJ's career with period-accurate visuals and commentary. On-court, the game refines stick controls for dribble moves, shot timing, and defensive positioning. The WNBA finally receives deeper franchise options beyond single seasons. Despite criticism over aggressive monetization and minimal year-to-year improvements, NBA 2K remains unmatched in presentation - from authentic arena atmospheres to Ernie Johnson's studio analysis. For basketball purists, the simulation sliders and robust coaching options deliver the most authentic NBA experience outside of attending a real game."
  },
  {
    "id": 60,
    "name": "FIFA 23",
    "releaseDate": "2022-09-30",
    "rating": 3.10,
    "tags": ["sports", "soccer", "simulation", "multiplayer", "ea"],
    "img": "https://upload.wikimedia.org/wikipedia/en/6/62/FIFA_23_cover.jpg",
    "shortDescription": "Latest EA Sports soccer sim.",
    "fullDescription": "The final FIFA-branded entry (before the EA Sports FC rebrand) introduces women's club teams and cross-play for the first time. Hypermotion2 technology captures more realistic animations, while the new risk/reward power shot mechanic adds scoring variety. Career mode lets players create player-managers and experience a 'buzz' system for transfer negotiations. Volta's street football returns with new locations and customization. Ultimate Team remains the controversial cash cow, with its card-collecting, chemistry systems, and relentless pack openings. The World Cup mode arrives via free update, featuring the 2022 Qatar tournament's official presentation. While criticized for iterative improvements and predatory monetization, FIFA's unparalleled licensing (over 700 teams and 30 leagues) ensures its dominance. The game's accessibility and pick-up-and-play appeal make it a staple for casual fans, even as its competitive scene struggles with mechanical inconsistencies."
  },
  {
    "id": 61,
    "name": "The Sims 3",
    "releaseDate": "2009-06-02",
    "rating": 4.40,
    "tags": ["life-sim", "sandbox", "open-world", "customization", "ea"],
    "img": "https://upload.wikimedia.org/wikipedia/en/d/d6/The_Sims_3_cover.png",
    "shortDescription": "Life sim that revolutionized The Sims formula.",
    "fullDescription": "The Sims 3's major innovation was its open neighborhood, eliminating loading screens between lots. The Create-a-Sim tool introduced trait-based personalities (like 'evil' or 'artistic') that affected autonomous behavior. The wishes system replaced aspirations with dynamic goals. Expansions added supernatural elements (vampires, werewolves), world adventures with puzzle tombs, and university life. The store sold premium worlds like Midnight Hollow, while mods extended gameplay with custom careers and objects. Despite performance issues and a controversial online store, Sims 3 offered unparalleled freedom - following Sims to work as firefighters or detectives, or simply watching generational stories unfold. The color wheel allowed deep customization of objects and clothing, while the pattern tool let players design their own fabrics. For many fans, this entry represents the series' peak before the more restrictive Sims 4."
  },
  {
    "id": 62,
    "name": "Crash Bandicoot N. Sane Trilogy",
    "releaseDate": "2017-06-30",
    "rating": 4.35,
    "tags": ["platformer", "remaster", "difficult", "nostalgia", "ps1"],
    "img": "https://upload.wikimedia.org/wikipedia/en/3/36/Crash_Bandicoot_N._Sane_Trilogy.png",
    "shortDescription": "Remastered classic platformers.",
    "fullDescription": "Vicarious Visions' faithful remaster of the original PS1 trilogy updates the graphics while retaining the challenging gameplay. Crash's stiff jumping physics and precise corridor platforming feel simultaneously nostalgic and freshly punishing. The collection includes Crash Bandicoot, Cortex Strikes Back, and Warped, each with their own gimmicks like riding tigers or piloting biplanes. Time trials add replayability, while the unified save system and checkpoint mechanics modernize the experience. The remaster's most controversial change was altering collision physics, making some jumps harder than the originals. Bonus levels like Stormy Ascent (originally cut for difficulty) provide brutal challenges for completionists. The cartoony visuals pop with new lighting and textures, while the rearranged soundtrack keeps the iconic melodies. This collection proved Crash's enduring appeal, paving the way for new entries like It's About Time."
  },
  {
    "id": 63,
    "name": "Spyro Reignited Trilogy",
    "releaseDate": "2018-11-13",
    "rating": 4.45,
    "tags": ["platformer", "remaster", "collectathon", "dragons", "ps1"],
    "img": "https://upload.wikimedia.org/wikipedia/en/6/6a/Spyro_Reignited_Trilogy.jpg",
    "shortDescription": "Charming dragon platformer collection.",
    "fullDescription": "Toys for Bob's remake of Insomniac's classic trilogy brings the purple dragon into HD with lovingly redesigned characters and environments. The games (Spyro the Dragon, Ripto's Rage, and Year of the Dragon) retain their original structure - free-roaming worlds filled with gems to collect and dragons/eggs to rescue. The remake adds quality-of-life improvements like camera control and a unified mini-map. The soundtrack offers both remastered and original versions of Stewart Copeland's iconic compositions. Spyro's charge-and-flame combat remains simple but satisfying, while flight levels and skateboarding minigames provide variety. The Reignited versions emphasize each world's distinct personality, from the autumnal Artisans to the surreal Dream Weavers. Though easier than Crash Bandicoot, Spyro's emphasis on exploration and whimsical humor created a different kind of platforming charm that this remaster perfectly preserves."
  },
  {
    "id": 64,
    "name": "Forza Horizon 4",
    "releaseDate": "2018-10-02",
    "rating": 4.65,
    "tags": ["racing", "open-world", "cars", "britain", "multiplayer"],
    "img": "https://upload.wikimedia.org/wikipedia/en/2/24/Forza_Horizon_4_cover_art.jpg",
    "shortDescription": "Open‑world UK racing game.",
    "fullDescription": "Playground Games' celebration of British car culture features dynamic seasons that weekly transform the map - frozen lakes become drivable in winter, while autumn leaves affect traction. The shared world seamlessly blends solo and multiplayer, with Forzathon Live events encouraging cooperative challenges. Over 450 cars range from classic Minis to hypercars like the McLaren Senna, all customizable with deep tuning options. The festival site expands as players complete races, stunts, and PR stunts across Edinburgh, the Lake District, and the Cotswolds. House purchases unlock perks like fast travel, while the Eliminator battle royale mode adds a unique spin. LEGO and Fortune Island DLCs provided whimsical and extreme driving experiences respectively. Forza Horizon 4's greatest achievement is making every drive, whether a focused race or casual cruise, feel rewarding through its impeccable handling model and ever-changing world."
  },
  {
    "id": 65,
    "name": "Mario Kart 8 Deluxe",
    "releaseDate": "2017-04-28",
    "rating": 4.85,
    "tags": ["racing", "multiplayer", "nintendo", "family-friendly", "switch"],
    "img": "https://upload.wikimedia.org/wikipedia/en/0/0d/MarioKart8Deluxe.jpg",
    "shortDescription": "Ultimate Switch kart racer.",
    "fullDescription": "This enhanced Wii U port remains the definitive Mario Kart experience, featuring all DLC tracks and characters plus new additions like Inkling Girl and King Boo. The anti-gravity sections from the original add verticality to tracks like Rainbow Road or Mount Wario. Deluxe's major addition was revamped battle modes (Balloon Battle, Renegade Roundup) on dedicated arenas. The smart steering and auto-accelerate options make the game more accessible, while 200cc provides a challenge for veterans. The Booster Course Pass DLC adds 48 remastered tracks from past games, extending the roster to 96 courses. Local multiplayer supports up to 4 players at 60fps, while online races (with proper lobbies) keep competition lively. From the underwater sections of Dolphin Shoals to the gliding mechanics in Cloudtop Cruise, Mario Kart 8 Deluxe polishes the series' formula to near-perfection with unmatched visual flair and gameplay variety."
  },
  {
    "id": 66,
    "name": "It Takes Two",
    "releaseDate": "2021-03-26",
    "rating": 4.75,
    "tags": ["co-op", "platformer", "story-driven", "split-screen", "hazelight"],
    "img": "https://upload.wikimedia.org/wikipedia/en/3/3a/It_Takes_Two_cover.png",
    "shortDescription": "Co‑op adventure on relationship themes.",
    "fullDescription": "Hazelight's mandatory two-player game follows Cody and May, a couple turned into dolls by their daughter's magic. The split-screen gameplay constantly introduces new mechanics tailored to each character - one controls time while the other manipulates space, or one flies a kite while the other grapples. The imaginative settings range from a snow globe village to a cosmic space book, each with unique co-op puzzles. The story balances slapstick humor (like battling a vacuum cleaner) with surprisingly mature themes about divorce and reconciliation. Friend's Pass allows one player to own the game while another joins free online. Mini-games like chess or whack-a-mole provide competitive breaks. It Takes Two stands as one of gaming's best arguments for cooperative play, requiring constant communication and mutual support to progress through its whimsical but emotionally grounded journey."
  },
  {
    "id": 67,
    "name": "Dead Cells",
    "releaseDate": "2018-08-07",
    "rating": 4.60,
    "tags": ["roguelike", "metroidvania", "action", "difficult", "pixel-art"],
    "img": "https://upload.wikimedia.org/wikipedia/en/c/c8/Dead_Cells_cover.jpg",
    "shortDescription": "Roguelike metroidvania action game.",
    "fullDescription": "Motion Twin's 'roguevania' blends procedurally generated levels with permanent ability-gated progression. The Beheaded's fluid combat combines dodges, parries, and varied weapons (from whips to lightning bolts). The malaise system adds time pressure in higher difficulties, while custom mode allows tailoring item pools. Boss cells progressively increase challenge, with the true ending requiring mastery of 5BC. Updates have added free content like new biomes (Fractured Shrines), weapons (Serenade's flying sword), and crossover DLCs (Castlevania, Hollow Knight). The game's pixel art animations and responsive controls make every death feel earned rather than unfair. The loop of trying new builds (brutality vs tactics vs survival) while memorizing enemy patterns creates an addictive 'one more run' mentality. Dead Cells respects the player's time by making each attempt meaningful through permanent unlocks and gradual skill improvement."
  },
  {
    "id": 68,
    "name": "Subnautica",
    "releaseDate": "2018-01-23",
    "rating": 4.65,
    "tags": ["survival", "open-world", "underwater", "exploration", "horror"],
    "img": "https://upload.wikimedia.org/wikipedia/en/4/49/Subnautica_cover.jpg",
    "shortDescription": "Underwater survival exploration.",
    "fullDescription": "Unknown Worlds' survival game strands players on alien planet 4546B after their spaceship crashes into its ocean. The game masterfully balances wonder and terror as you explore vibrant coral reefs, hydrothermal vents, and terrifying abyssal trenches. The Seamoth and Cyclops submarines allow deeper exploration, while scanner rooms help locate resources. Leviathan-class creatures like the Reaper or Ghost Leviathan create heart-pounding encounters. The story unfolds through radio transmissions and abandoned PDAs, revealing the fate of the Degasi survivors and the mysterious Kharaa bacterium. Base building ranges from simple observation tubes to sprawling multi-level habitats with alien containment tanks. Below Zero's standalone expansion added arctic biomes and a more narrative-driven experience. Subnautica's greatest strength is its emergent storytelling - the panic of oxygen management, the awe of discovering a new ecosystem, and the dread of descending into the unknown with only a sonar ping for orientation."
  },
  {
    "id": 69,
    "name": "Return to Monkey Island",
    "releaseDate": "2022-09-19",
    "rating": 4.40,
    "tags": ["point-and-click", "adventure", "comedy", "nostalgia", "puzzle"],
    "img": "https://upload.wikimedia.org/wikipedia/en/3/30/Return_To_Monkey_Island_cover.png",
    "shortDescription": "Return to classic point‑and‑click pirate comedy.",
    "fullDescription": "Ron Gilbert's unexpected return to the series he created blends classic adventure game puzzles with modern conveniences like hint systems and streamlined verb interactions. The story follows an older Guybrush Threekwood still searching for the secret of Monkey Island, now with his son Boybrush in tow. The art style's exaggerated proportions and vibrant colors pay homage to the original's aesthetic while feeling fresh. Puzzles involve classic inventory combinations and dialogue trees, with solutions ranging from absurd (using a grog machine as a distraction) to clever (mapping a shipwreck's layout). The writing maintains the series' signature humor, from incompetent pirates to fourth-wall-breaking jokes about adventure game logic. Easy mode simplifies puzzles for narrative-focused players, while hard mode offers the full challenge. For longtime fans, the game provides a satisfying conclusion to Guybrush's arc while remaining accessible to newcomers through its charming presentation and witty writing."
  },
  {
    "id": 70,
    "name": "Dying Light 2 Stay Human",
    "releaseDate": "2022-02-04",
    "rating": 4.25,
    "tags": ["open-world", "zombies", "parkour", "rpg", "co-op"],
    "img": "https://upload.wikimedia.org/wikipedia/en/2/2e/Dying_Light_2_Stay_Human_cover_art.jpg",
    "shortDescription": "Parkour zombie survival sequel.",
    "fullDescription": "Techland's sequel expands the original's day-night cycle with a decaying city where faction choices physically alter the environment. Aiden Caldwell's parkour feels fluid, with new moves like wall running and paragliding opening vertical exploration. The RPG-lite system allows specializing in combat, agility, or survival skills. Volatile zombies remain terrifying night predators, while human factions like the Peacekeepers or Renegades provide daytime threats. The dynamic gore system makes every weapon impact visceral, whether slicing limbs with a katana or crushing skulls with a hammer. Co-op supports up to 4 players with shared world progress. The story's choices lead to different district outcomes and endings, though the writing lacks the first game's charm. Regular updates have added content like firearms and graphical improvements. Despite a rocky launch, Dying Light 2 delivers thrilling movement and brutal combat that make traversing its zombie-infested ruins consistently engaging."
  },
  {
    "id": 71,
    "name": "No Man’s Sky",
    "releaseDate": "2016-08-09",
    "rating": 4.50,
    "tags": ["open-world", "space", "procedural", "exploration", "multiplayer"],
    "img": "https://upload.wikimedia.org/wikipedia/en/8/82/No_Mans_Sky_cover_art.jpg",
    "shortDescription": "Procedural space exploration sandbox.",
    "fullDescription": "Hello Games' redemption story transformed from a controversial launch into one of gaming's greatest comebacks through years of free updates. The game now features base building, VR support, alien settlements, mechs, and full multiplayer across quintillions of procedurally generated planets. The core loop of mining resources, upgrading gear, and discovering strange creatures remains, but with vastly more depth - tame robotic companions, command fleets of frigates, or uncover the mysterious Atlas lore. Community expeditions bring players together for shared goals, while the Nexus hub allows meeting random travelers. Visual overhauls improved terrain generation and weather effects, making each planet feel more unique. From derelict freighters to underwater bases, No Man's Sky now delivers the infinite adventure originally promised, supported by a developer that refused to abandon their ambitious vision."
  },
  {
    "id": 72,
    "name": "Resident Evil Village",
    "releaseDate": "2021-05-07",
    "rating": 4.45,
    "tags": ["horror", "action", "first-person", "vampires", "single-player"],
    "img": "https://upload.wikimedia.org/wikipedia/en/7/7d/Resident_Evil_Village_Box_Art.jpg",
    "shortDescription": "Horror survival in a creepy village.",
    "fullDescription": "Ethan Winters' journey through a nightmare European village channels gothic horror tropes with Resident Evil's signature combat. The game's structure divides between distinct areas ruled by monstrous 'lords' - Lady Dimitrescu's castle, House Beneviento's psychological horror, and Heisenberg's factory. The merchant Duke provides upgrades and dark humor between terrifying encounters with lycans and mutated creatures. The inventory management and crafting recall RE4, while the first-person perspective maintains RE7's intimacy. Mercenaries mode returns with arcade-style scoring, and the Shadows of Rose DLC expands the story. Though less scary than its predecessor, Village excels in variety - one moment you're solving ornate puzzles in a vampire's lair, the next you're fending off a werewolf siege with limited ammo. The tall vampire ladies became instant icons, but the game's true strength lies in balancing action and horror across its memorable set pieces."
  },
  {
    "id": 73,
    "name": "ARK: Survival Evolved",
    "releaseDate": "2017-08-29",
    "rating": 4.20,
    "tags": ["survival", "dinosaurs", "open-world", "crafting", "multiplayer"],
    "img": "https://upload.wikimedia.org/wikipedia/en/0/0c/Ark_Survival_Evolved_cover.jpg",
    "shortDescription": "Dinosaur taming survival game.",
    "fullDescription": "Studio Wildcard's dino-survival simulator drops players naked onto an island filled with prehistoric creatures, from docile dodos to towering titanosaurs. Taming involves knocking creatures unconscious and feeding them preferred foods - a process that can take hours for high-level beasts. The game's technical depth includes breeding for superior stats, electricity systems, and automated farming. PvP servers feature tribe warfare with dinosaur-mounted combat, while PvE focuses on cooperative building. Expansion maps introduce fantastical elements like wyverns and rock drakes. Despite performance issues and a steep learning curve, ARK delivers unmatched stories of emergent gameplay - escaping a raptor attack by taming a passing trike, or losing weeks of progress to a rival tribe's raid. The free Survival of the Fittest mode condensed the experience into a battle royale format, showcasing the game's versatile systems."
  },
  {
    "id": 74,
    "name": "Rainbow Six Siege",
    "releaseDate": "2015-12-01",
    "rating": 4.55,
    "tags": ["tactical", "fps", "multiplayer", "destruction", "competitive"],
    "img": "https://upload.wikimedia.org/wikipedia/en/5/5f/Rainbow_Six_Siege_cover_art.jpg",
    "shortDescription": "Tactical team‑based shooter.",
    "fullDescription": "Ubisoft's competitive shooter evolved from a niche tactical game into an esports staple through constant updates and operator additions. Matches pit 5v5 attackers and defenders in objective-based scenarios where every wall can be breached or reinforced. Operators like Ash (breaching rounds) or Mira (one-way mirrors) provide unique gadgets that synergize with teammates. The game's sound design allows experienced players to track enemies through floors, while destruction creates unpredictable sightlines. Newcomers face a steep learning curve memorizing maps and operator counters, but the ranked system ensures fair matchmaking. Seasonal updates rework older maps and introduce new operators, keeping the meta fresh seven years post-launch. Despite controversies over cheating and toxicity, Siege remains the gold standard for tactical FPS gameplay, where every round tells a unique story of adaptation and teamwork."
  },
  {
    "id": 75,
    "name": "The Last of Us",
    "releaseDate": "2013-06-14",
    "rating": 4.90,
    "tags": ["story-driven", "post-apocalyptic", "zombies", "emotional", "naughty-dog"],
    "img": "https://upload.wikimedia.org/wikipedia/en/4/4c/The_Last_of_Us_cover.jpg",
    "shortDescription": "Post‑apocalyptic survival drama.",
    "fullDescription": "Naughty Dog's masterpiece follows Joel and Ellie's journey across a fungal apocalypse America, blending brutal survival gameplay with unparalleled character writing. The game's balance of stealth, resource scarcity, and desperate melee combat reinforces its grim tone. Moments like the giraffe scene or the winter chapter with David showcase gaming's narrative potential. The Left Behind DLC explores Ellie's backstory with Riley, while the PS5 remake modernized visuals and AI. Multiplayer's Factions mode offered tense 4v4 matches with crafting and limited respawns. What begins as a simple escort mission becomes a meditation on love, loss, and moral compromise, culminating in one of gaming's most controversial endings. The performances by Troy Baker and Ashley Johnson, combined with Gustavo Santaolalla's haunting score, create an experience that lingers long after the credits roll. The Last of Us redefined what games could achieve emotionally while delivering taut, satisfying gameplay."
  },
  {
    "id": 76,
    "name": "Journey",
    "releaseDate": "2012-03-13",
    "rating": 4.80,
    "tags": ["art", "adventure", "multiplayer", "wordless", "thatgamecompany"],
    "img": "https://upload.wikimedia.org/wikipedia/en/e/ef/Journey_2012_video_game_cover.jpg",
    "shortDescription": "Artistic, wordless adventure.",
    "fullDescription": "Thatgamecompany's minimalist masterpiece follows a robed figure traveling toward a distant mountain through deserts, ruins, and snowfields. The game's anonymous multiplayer pairs you with random travelers who can only communicate through musical chimes, creating profound connections without words. Gliding across sand dunes or weaving through ancient cloth creatures evokes childlike wonder, while the subterranean apocalypse sequence inspires genuine fear. Austin Wintory's Grammy-nominated score adapts dynamically to player actions, building to an emotional crescendo during the final ascent. The game's length (2-3 hours) ensures every moment feels purposeful, while hidden glyphs and murals hint at deeper lore. Journey demonstrates how interactivity can create unique emotional resonance - the relief of finding a companion after solitude, or the bittersweet farewell at the summit. Its influence persists in countless games chasing similar transcendent moments through simplicity and artistry."
  },
  {
    "id": 77,
    "name": "Limbo",
    "releaseDate": "2010-07-21",
    "rating": 4.40,
    "tags": ["puzzle-platformer", "indie", "dark", "atmospheric", "minimalist"],
    "img": "https://upload.wikimedia.org/wikipedia/en/8/8c/Limbo_cover_art.png",
    "shortDescription": "Moody minimalist platformer.",
    "fullDescription": "Playdead's debut established their signature style of monochromatic visuals, environmental storytelling, and brutal puzzle deaths. The silent boy's journey through a forest filled with deadly traps and grotesque creatures creates an unsettling fairy tale atmosphere. Puzzles often involve timing and physics - avoiding bear traps, outrunning a giant spider, or manipulating gravity switches. The game's trial-and-error nature makes each success feel earned, while the ambiguous ending invites interpretation. Later sequences introduce mind-bending perspective tricks and eerie industrial environments. Limbo's restrained approach (no dialogue, no HUD, no music beyond ambient drones) forces players to project their own meaning onto the haunting imagery. The game proved indie titles could achieve mainstream success through distinctive art direction and uncompromising vision, paving the way for successors like Inside."
  },
  {
    "id": 78,
    "name": "Inside",
    "releaseDate": "2016-06-29",
    "rating": 4.65,
    "tags": ["puzzle-platformer", "indie", "dystopian", "atmospheric", "playdead"],
    "img": "https://upload.wikimedia.org/wikipedia/en/e/ec/Inside_cover_art.jpg",
    "shortDescription": "Dark, puzzle‑platformer follow‑up to Limbo.",
    "fullDescription": "Playdead's spiritual successor to Limbo follows a boy fleeing through a nightmarish research facility controlling zombified humans. The game's puzzles involve manipulating these 'husks' - using them as weights or distracting attack dogs. The 2.5D visuals create striking compositions, from underwater labs to cornfield chases. The infamous 'shockwave' sequence and the grotesque finale (transforming into a fleshy blob) rank among gaming's most unforgettable moments. Environmental details hint at a larger dystopian world where children are harvested for some unknown purpose. Like Limbo, Inside communicates entirely through visuals and gameplay, with its meaning left tantalizingly ambiguous. The subtle sound design and lack of music amplify the oppressive atmosphere. The game's short length (3-4 hours) ensures no idea overstays its welcome, culminating in a climax that shocks, disturbs, and lingers in memory long after completion."
  },
  {
    "id": 79,
    "name": "Uncharted: The Lost Legacy",
    "releaseDate": "2017-08-22",
    "rating": 4.40,
    "tags": ["adventure", "action", "treasure-hunt", "spin-off", "naughty-dog"],
    "img": "https://upload.wikimedia.org/wikipedia/en/9/9a/Uncharted_The_Lost_Legacy.png",
    "shortDescription": "Standalone Uncharted adventure.",
    "fullDescription": "This Chloe Frazer-led spinoff proves Uncharted's formula works beyond Nathan Drake, set in the Western Ghats during India's civil war. The dynamic between Chloe and Nadine (initially distrustful) evolves naturally through witty banter and shared peril. The open-ended chapter 'The Great Battle' allows approaching objectives in any order, showcasing Naughty Dog's experimentation with non-linearity. Puzzle-solving utilizes ancient Hoysala architecture, while set pieces like the train sequence rival the main series' best. Asav makes for a compelling villain with his ideological extremism contrasting Chloe's mercenary pragmatism. The game's shorter length (6-8 hours) focuses the experience without filler, while the photography mode captures India's vibrant landscapes. Lost Legacy demonstrates how to gracefully pass the torch to new protagonists while retaining what made the original special - thrilling action, charismatic leads, and spectacular locales steeped in history and myth."
  },
  {
    "id": 80,
    "name": "Final Fantasy XIV: A Realm Reborn",
    "releaseDate": "2013-08-27",
    "rating": 4.85,
    "tags": ["mmorpg", "fantasy", "story-driven", "multiplayer", "square-enix"],
    "img": "https://upload.wikimedia.org/wikipedia/en/9/9b/Final_Fantasy_XIV_A_Realm_Reborn_cover.jpg",
    "shortDescription": "Revived MMORPG with a strong story.",
    "fullDescription": "Square Enix's unprecedented redemption story transformed a failed 2010 MMO into one of gaming's most beloved communities through complete overhaul. Players create their Warrior of Light, choosing from classic FF jobs (Dragoon, White Mage, etc.) that can be swapped freely. The narrative builds from humble beginnings into cosmic stakes across expansions (Heavensward, Shadowbringers, Endwalker). Dungeons and trials (8-player boss fights) feature elaborate mechanics requiring teamwork, while the Gold Saucer offers casual minigames. The free trial includes hundreds of hours of content up to level 60. Regular patches add story chapters and raids tied to the ongoing saga. FFXIV stands out for respecting players' time - no gear treadmills, generous catch-up systems, and a focus on horizontal progression. From emotional character arcs to breathtaking musical themes like 'Answers' or 'Close in the Distance,' the game delivers a JRPG-quality story within a thriving MMO world."
  }
]